[
  {
    "name": "17c/45 spaceship",
    "description": "A {spaceship} travelling at seventeen forty-fifths of the {speed of light}. This was the first known {macro-spaceship} speed. See {Caterpillar} for details."
  },
  {
    "name": "(2,1)c/6 spaceship",
    "description": "A {knightship} that travels obliquely at the fastest possible speed. To date the only known example of a spaceship with this velocity is {Sir Robin}."
  },
  {
    "name": "24-cell quadratic growth",
    "description": "A 39786x143 {quadratic growth} pattern found by Michael Simkin in October 2014, two days after {25-cell quadratic growth} and a week before {switch-engine ping-pong}."
  },
  {
    "name": "25-cell quadratic growth",
    "description": "A 25-cell quadratic growth pattern found by Michael Simkin in October 2014, with a bounding box of 21372x172. It was the smallest-population quadratic growth pattern for two days, until the discovery of {24-cell quadratic growth}. It superseded {wedge}, which had held the record for eight years. See {switch-engine ping-pong} for the lowest-population {superlinear growth} pattern as of July 2018, along with a list of the record-holders."
  },
  {
    "name": "2c/3",
    "description": "Two thirds of the speed of light - the speed of signals in a {2c/3 wire} or of some {against the grain} {negative spaceship} signals in the {zebra stripes} {agar}, and also the speed of {burn}ing of the {blinker fuse} and the {bi-block fuse}."
  },
  {
    "name": "2c/5 spaceship",
    "description": "A {spaceship} travelling at two fifths of the {speed of light}. The only such spaceships that are currently known travel orthogonally. Examples include {30P5H2V0}, {44P5H2V0}, {60P5H2V0}, and {70P5H2V0}. As of June 2018, only 30P5H2V0 and 60P5H2V0 have known {glider synthesis} {recipe}s."
  },
  {
    "name": "2c/7 spaceship",
    "description": "A {spaceship} travelling at two sevenths of the {speed of light}. The only such spaceships that are currently known travel orthogonally. The first to be found was the {weekender}, found by David Eppstein in January 2000. See also {weekender distaff}."
  },
  {
    "name": "2-glider collision",
    "description": "Two gliders can react with each other in many different ways, either at right angles, or else head-on. A large number of the reactions cleanly destroy both gliders leaving nothing. Many of the remaining reactions cleanly create some common objects, and so are used as the first steps in {glider synthesis} or as part of constructing interesting objects using {rake}s. Only a small number of collisions can be considered {dirty} due to creating multiple objects or a mess. Here is a list of the possible results along with how many different ways they can occur (ignoring reflections and rotations). ------------------------------- result right-angle head-on ------------------------------- nothing 11 17 {beehive} 1 0 {B-heptomino} 1 2 {bi-block} 1 0 {blinker} 2 1 {block} 3 3 {boat} 0 1 {eater1} 1 0 {glider} 1 1 {honey farm} 3 2 {interchange} 1 0 {loaf} 0 1 {lumps of muck} 1 0 {octomino} 0 1 {pi-heptomino} 2 1 {pond} 1 1 {teardrop} 1 0 {traffic light} 2 1 {four skewed blocks} 0 1 {dirty} 6 0 ------------------------------- The messiest of the two-glider collisions in the \"dirty\" category is {2-glider mess}."
  },
  {
    "name": "31c/240",
    "description": "The rate of travel of the {31c/240 Herschel-pair climber} reaction, and {Caterpillar}-type spaceships based on that reaction. Each {Herschel} travels 31 cells orthogonally every 240 {tick}s."
  },
  {
    "name": "3c/7 spaceship",
    "description": "A {spaceship} travelling at three sevenths of the {speed of light}. The only such spaceships that are currently known travel orthogonally. The first to be found was the {spaghetti monster}, found by Tim Coe in June 2016."
  },
  {
    "name": "9hd",
    "description": "Separated by 9 {half diagonal}s. Specifically used to describe the distance between the two {construction lane}s in the {linear propagator}."
  },
  {
    "name": "against-the-grain grey ship",
    "description": "A {grey ship} in which the region of density 1/2 consists of lines of ON cells lying perpendicular to the direction in which the spaceship moves. See also {with-the-grain grey ship}."
  },
  {
    "name": "agar",
    "description": "Any pattern covering the whole plane that is periodic in both space and time. The simplest (nonempty) agar is the {stable} one extended by the known {spacefiller}s. For some more examples see {chicken wire}, {houndstooth agar}, {onion rings}, {squaredance} and {Venetian blinds}. Tiling the plane with the pattern O......O produces another interesting example: a p6 agar which has a phase of {density} 3/4, which is the highest yet obtained for any phase of an oscillating pattern. See {lone dot agar} for an agar composed of isolated cells."
  },
  {
    "name": "ambidextrous",
    "description": "A type of {Herschel transceiver} where the {receiver} can be used in either of two mirror-image orientations. See also {chirality}."
  },
  {
    "name": "anteater",
    "description": "A pattern that consumes {ants}. Matthias Merzenich discovered a c/5 anteater on 15 April 2011. See {wavestretcher} for details."
  },
  {
    "name": "apgsearch",
    "description": "One of several versions of a client-side Ash Pattern Generator {soup} search script by Adam P. Goucher, for use with Conway's Life and a wide variety of other rules. Development of the original {Golly}-based Python script started in August 2014. After the addition in 2016 of apgnano (native C++) and apgmera (self-modifying, 256-bit SIMD compatibility), development continues in 2017 with apgluxe (Larger Than Life and Generations rules, more soup shapes). Several customized variants of the Python script have also been created by other programmers, to perform types of searches not supported by Goucher's original apgsearch 1.x. All of these versions of the search utility work with a \"haul\" that usually consists of many thousands or millions of random soup patterns. Each soup is run to stability, and detailed object {census} results are reported to {Catagolue}. For any rare objects discovered in the {ash}, the source soup can be easily retrieved from the Catagolue server."
  },
  {
    "name": "APPS",
    "description": "An asymmetric {PPS}. The same as the {SPPS}, but with the two halves 15 generations out of phase with one another. Found by Alan Hensel in May 1998."
  },
  {
    "name": "armless",
    "description": "A method of generating {slow salvo}s across a wide range of lanes without using a {construction arm} with a movable {elbow}. Instead, streams of gliders on two fixed opposing {lane}s collide with each other to produce clean 90-degree output gliders. Slowing down one of the streams by 8N ticks will move the output lanes of the gliders toward the source of that stream by N {full diagonal}s. This construction method was used to create the supporting slow salvos in the {half-baked knightship}s, and also in the {Parallel HBK gun}."
  },
  {
    "name": "ash",
    "description": "The {stable} or oscillating objects left behind when a chaotic reaction stabilizes, or \"burns out\". Experiments show that for random {soup}s with moderate initial densities (say 0.25 to 0.5) the resulting ash has a density of about 0.0287. (This is, of course, based on what happens in finite fields. In infinite fields the situation may conceivably be different in the long run because of the effect of certain initially very rare objects such as {replicator}s.)"
  },
  {
    "name": "asynchronous",
    "description": "Indicates that precise relative timing is not needed for two or more input {signal}s entering a {circuit}, or two or more sets of {glider}s participating in a {glider synthesis}. In some cases the signals or sets of gliders can arrive in any order at all - i.e., they have non-overlapping effects. However, in some cases such as {slow salvo} constructions, there is a required order for some of the incoming signals. These signals can still be referred to as \"asynchronous\" because the number of ticks between them is infinitely adjustable: arbitrarily long delays can be added with no change to the final result. Compare {synchronized}."
  },
  {
    "name": "backward glider",
    "description": "A {glider} which moves at least partly in the opposite direction to the {puffer}(s) or {spaceship}(s) under consideration."
  },
  {
    "name": "bait",
    "description": "An object in a {converter}, usually a small {still life}, that is temporarily destroyed by an incoming {signal}, but in such a way that a usable output signal is produced. In general such a converter produces multiple output signals (or a signal {splitter} is added) and one branch of the output is routed to a {factory} mechanism that rebuilds the bait object so that the converter can be re-used."
  },
  {
    "name": "barberpole",
    "description": "Any p2 oscillator in the infinite sequence {bipole}, {tripole}, {quadpole}, {pentapole}, {hexapole}, {heptapole} ... (It wasn't my idea to suddenly change from Latin to Greek.) This sequence of oscillators was found by the MIT group in 1970. The term is also used (usually in the form \"barber pole\") to describe other {extensible} sections of oscillators or spaceships, especially those (usually of period 2) in which all generations look alike except for a translation and/or rotation/reflection. Any barberpole can be lengthened by the reaction shown in {barbershop}. See also {pseudo-barberpole}."
  },
  {
    "name": "Bellman",
    "description": "A program for searching catalytic reactions, developed by Mike Playle, which successfully found the {Snark}."
  },
  {
    "name": "belly spark",
    "description": "The spark of a {MWSS} or {HWSS} other than the {tail spark}."
  },
  {
    "name": "billiard table configuration",
    "description": "Any {oscillator} in which the {rotor} is enclosed within the {stator}. Examples include {airforce}, {cauldron}, {clock II}, {Hertz oscillator}, {negentropy}, {pinwheel}, {pressure cooker} and {scrubber}."
  },
  {
    "name": "bit",
    "description": "A live {cell}, if used in reference to {still life} {population}. For example, a {beehive} is a 6-bit still life. Other uses generally involve information storage: a {memory cell} such as a {honey bit} that can hold one binary bit of information for later retrieval."
  },
  {
    "name": "blasting cap",
    "description": "The {pi-heptomino} (after the shape at generation 1). A term used at MIT and still occasionally encountered."
  },
  {
    "name": "block factory",
    "description": "Any {factory} {circuit} that produces a {block} in response to an input signal. For a useful high-{clearance} example see {keeper}."
  },
  {
    "name": "Blockic",
    "description": "Adjective for {constellation}s consisting entirely of {block}s. It's possible to arrange blocks in a way that can be {trigger}ed by a single glider to produce any {glider constructible} pattern. A simple example of a Blockic pattern is shown under {fuse}. See also {seed}."
  },
  {
    "name": "blonk",
    "description": "A {block} or a {blinker}. This term is mainly used in the context of {sparse Life} and was coined by Rich Schroeppel in September 1992."
  },
  {
    "name": "bouncer",
    "description": "A label used for the small periodic {colour-changing} {glider} {reflector}s discovered mainly by Noam Elkies in the late 1990s. See {p5 bouncer}, {p6 bouncer}, {p7 bouncer}, {p8 bouncer}, or {p15 bouncer}."
  },
  {
    "name": "bounding box",
    "description": "The smallest rectangular array of cells that contains the whole of a given pattern. For {oscillator}s and {gun}s this usually is meant to include all {phase}s of the pattern, but in the case of guns, the outgoing stream(s) are excluded. The bounding box is one of the standard ways to measure the size of an object; the other standard metric is the {population}."
  },
  {
    "name": "breeder",
    "description": "Any pattern whose {population} grows at a quadratic rate, although it is usual to exclude {spacefiller}s. It is easy to see that this is the fastest possible growth rate. The term is also sometimes used to mean specifically the breeder created by Bill Gosper's group at MIT, which was the first known pattern exhibiting {superlinear growth}. There are four common types of breeder, known as MMM, MMS, MSM and SMM (where M=moving and S=stationary). Typically an MMM breeder is a {rake} {puffer}, an MMS breeder is a puffer producing puffers which produce stationary objects ({still life}s and/or {oscillator}s), an MSM breeder is a {gun} puffer and an SMM breeder is a rake gun. There are, however, less obvious variants of these types. Other less common breeder categories (SSS, hybrid MSS/MSM, etc.) can be created with some difficulty, based on {universal constructor} technology; see {Pianola breeder}. The original breeder was of type MSM (a p64 puffer puffing p30 glider guns). The known breeder with the smallest initial population is {switch-engine ping-pong}."
  },
  {
    "name": "bridge",
    "description": "A term used in naming certain {still life}s (and the {stator} part of certain {oscillator}s). It indicates that the object consists of two smaller objects joined edge to edge, as in {snake bridge snake}."
  },
  {
    "name": "broken lines",
    "description": "A pattern constructed by Dean Hickerson in May 2005 which produces complex broken lines of gliders and blocks."
  },
  {
    "name": "B track",
    "description": "A {track} for {B-heptomino}es. A B-heptomino becomes a {Herschel} plus a {block} in twenty generations, so this term was nearly synonymous with {Herschel track} until the discovery of {elementary conduit}s that convert a B directly to another B, or to some other non-Herschel signal output. See for example {BRx46B}."
  },
  {
    "name": "bumper",
    "description": "One of several periodic {colour-preserving} {glider} {reflector}s discovered by Tanner Jacobi on 6 April 2016. See {p3 bumper}, {p4 bumper}, {p5 bumper}, {p6 bumper}, {p7 bumper}, {p8 bumper}, {p9 bumper}, {p11 bumper}, and {p15 bumper}."
  },
  {
    "name": "burn",
    "description": "A reaction which travels indefinitely as a {wave} through the components of a {wick} or an {agar}. A burning wick is known as a {fuse}. If the object being burned has a spatial periodicity, then the active area of the burning usually remains bounded and so eventually develops a periodicity too. It is unknown whether this will always occur. The speed of burning can range from arbitrarily slow up to the {speed of light}. The results of burning can be clean (leaving no debris), or leaving debris usually much different from the original object. In rare cases, a {reburnable fuse} produces an exact copy of the original object, allowing the creation of objects such as the {telegraph}. In many useful cases burning can be initiated by impacting an object with {glider}s or other {spaceship}s. An object might be able to burn in more than one way, depending on how the burn is initiated."
  },
  {
    "name": "bushing",
    "description": "That part of the {stator} of an {oscillator} which is adjacent to the {rotor}. Compare {casing}."
  },
  {
    "name": "c/10 spaceship",
    "description": "A {spaceship} travelling at one tenth of the {speed of light}. The first such spaceship to be discovered was the orthogonally travelling {copperhead}, found by 'zdr' on 5 March 2016. Simon Ekstrom found the related {fireship} two weeks later. A {Caterloopillar} can theoretically be configured to move at c/10, but there are technical difficulties with speeds of the form 4n+2, and as of June 2018 this has not been done in practice."
  },
  {
    "name": "c/12 spaceship",
    "description": "A {spaceship} travelling at one twelfth of the {speed of light}. The only diagonal spaceships that are currently known to move at this speed are the {Cordership}s. An orthogonal {Caterloopillar} has been configured to move at c/12."
  },
  {
    "name": "c/2 spaceship",
    "description": "A {spaceship} travelling at half the {speed of light}. Such spaceships necessarily move orthogonally. The first to be discovered was the {LWSS}. For other examples see {Coe ship}, {ecologist}, {flotilla}, {hammerhead}, {hivenudger}, {HWSS}, {MWSS}, {puffer train}, {puff suppressor}, {pushalong}, {Schick engine}, {sidecar}, {still life tagalong} and {x66}."
  },
  {
    "name": "c/3 spaceship",
    "description": "A {spaceship} travelling at one third of the {speed of light}. All known c/3 spaceships travel orthogonally. The first was {25P3H1V0.1}, found in August 1989 by Dean Hickerson. For further examples see {brain}, {dart}, {edge-repair spaceship}, {fly}, {turtle} and {wasp}."
  },
  {
    "name": "c/4 spaceship",
    "description": "A {spaceship} travelling at one quarter of the {speed of light}. The first such spaceship to be discovered was, of course, the {glider}, and this remained the only known example until December 1989, when Dean Hickerson found the first orthogonal example, {119P4H1V0}, and also a new diagonal example (the {big glider}). For other examples see {B29}, {Canada goose}, {crane}, {Enterprise}, {edge-repair spaceship} (third pattern), {non-monotonic}, {Orion}, {quarter}, {sparky}, {swan} and {tagalong}. It is known that c/4 is the fastest possible speed for a (45-degree) diagonal spaceship."
  },
  {
    "name": "c/5 spaceship",
    "description": "A {spaceship} travelling at one fifth of the {speed of light}. The first such spaceship to be discovered was the {snail}, found by Tim Coe in January 1996. The first diagonally moving example, {295P5H1V1}, was found by Jason Summers in November 2000. For other c/5 ships see {58P5H1V1}, {67P5H1V1}, {86P5H1V1} and {spider}. A {Caterloopillar} has also been configured to move at c/5."
  },
  {
    "name": "c/7 spaceship",
    "description": "A {spaceship} travelling at one seventh of the {speed of light}. The first such spaceship to be discovered was the diagonally travelling {lobster}, found by Matthias Merzenich in August 2011. The first known orthogonal c/7 spaceship was the {loafer}, discovered by Josh Ball in February 2013. A {Caterloopillar} has been configured to move at c/7."
  },
  {
    "name": "caber tosser",
    "description": "Any pattern whose {population} is asymptotic to c.log(t) for some constant c, and which contains a {glider} (or other {spaceship}) bouncing between a slower receding spaceship and a fixed {reflector} which emits a spaceship (in addition to the reflected one) whenever the bouncing spaceship hits it. As the receding spaceship gets further away the bouncing spaceship takes longer to complete each cycle, and so the extra spaceships emitted by the reflector are produced at increasingly large intervals. More precisely, if v is the speed of the bouncing spaceship and u the speed of the receding spaceship, then each interval is (v+u)/(v-u) times as long as the previous one. The population at time t is therefore n.log(t)/log((v+u)/(v-u)) + O(1), where n is the population of one of the extra spaceships (assumed constant). The first caber tosser was built by Dean Hickerson in May 1991."
  },
  {
    "name": "casing",
    "description": "That part of the {stator} of an {oscillator} which is not adjacent to the {rotor}. Compare {bushing}."
  },
  {
    "name": "catacryst",
    "description": "A 58-cell {quadratic growth} pattern found by Nick Gotts in April 2000. This was formerly the smallest such pattern known, but has since been superseded by the related {metacatacryst}. See {switch-engine ping-pong} for the lowest-population {superlinear growth} pattern as of July 2018, along with a list of the record-holders. The catacryst consists of three {ark}s plus a glider-producing {switch engine}. It produces a block-laying switch engine every 47616 generations. Each block-laying switch engine has only a finite life, but the length of this life increases linearly with each new switch engine, so that the pattern overall grows quadratically, as an unusual type of MMS {breeder}."
  },
  {
    "name": "Catagolue",
    "description": "An online database of objects in Conway's Game of Life and similar cellular automata, set up by Adam P. Goucher in 2015 at {http://catagolue.appspot.com}. It gathers data from a distributed search of random initial configurations and records the eventual decay products. Within a year of operation it had completed a {census} of the {ash} objects from over two trillion asymmetric 16x16 {soup}s. As of June 2018, well over two hundred trillion ash objects have been counted, from over a trillion asymmetric soups. It is often possible to use Catagolue search results find equivalent {glider synthesis} recipes for selected parts of long-running active reactions. These random {soup} searches have made it possible to find efficient construction methods for thousands of increasingly rare {still life}s and {oscillator}s, and the occasional {puffer} or {spaceship}. In many of these cases a {glider synthesis} was previously very difficult or unknown."
  },
  {
    "name": "catalyst",
    "description": "An object that participates in a reaction but emerges from it unharmed. All {eater}s are catalysts. Some small {still life}s can act as catalysts in some situations, such as the {block}, {ship}, and {tub}. The still lifes and oscillators that form a {conduit} are examples of catalysts. A relatively rare form of catalysis occurs in a {transparent debris effect}, where the catalyst in question is completely destroyed and then rebuilt. The term is also sometimes used for a modification of an active reaction in a {rake} by passing {spaceship}s."
  },
  {
    "name": "Caterloopillar",
    "description": "A family of adjustable-speed {spaceship}s constructed by Michael Simkin in 2016, based on an \"engineless caterpillar\" idea originally proposed by David Bell. The front and back halves of Caterloopillars each function as universal constructors, with each half constructing the building blocks of the other half, while also reading and moving a construction tape. The overall design is reminiscent of M.C. Escher's lithograph \"Drawing Hands\". The name \"Caterloopillar\" is a reference to Douglas Hofstader's Strange Loop concept. Simkin has written an automated script that can construct a Caterloopillar for any rational speed strictly less than c/4, with some exceptions. Speeds closer to the c/4 limit in general require larger constructions, and for any given computer system it is easy to choose a speed that makes it impractical to construct a Caterloopillar. As of June 2018 one significant remaining exception is that Caterloopillars with periods c/(6+4N) can't be constructed. This is only a limitation of the current construction script, not of the underlying Caterloopillar {toolkit}. For technical reasons, the lowest speed that the current script can produce is around c/95. The slowest Caterloopillars that have been explicitly constructed to date are c/87 and c/92. These are among the smallest in terms of population, though their bounding boxes are larger than some of the higher-speed Caterloopillars."
  },
  {
    "name": "CatForce",
    "description": "An optimized {search program} written by Michael Simkin in 2015, using brute-force enumeration of small {Spartan} objects in a limited area, instead of a depth-first tree search. One major purpose of CatForce is to find glider-constructible completions for signal conduits. An early CatForce discovery was the {B60} conduit, which enabled a record-breaking new glider gun."
  },
  {
    "name": "cell",
    "description": "The fundamental unit of space in the Life universe. The term is often used to mean a live cell - the sense is usually clear from the context."
  },
  {
    "name": "cellular automaton",
    "description": "A certain class of mathematical objects of which {Life} is an example. A cellular automaton consists of a number of things. First there is a positive integer n which is the dimension of the cellular automaton. Then there is a finite set of states S, with at least two members. A state for the whole cellular automaton is obtained by assigning an element of S to each point of the n-dimensional lattice Z^n (where Z is the set of all integers). The points of Z^n are usually called cells. The cellular automaton also has the concept of a neighbourhood. The neighbourhood N of the origin is some finite (nonempty) subset of Z^n. The neighbourhood of any other cell is obtained in the obvious way by translating that of the origin. Finally there is a transition rule, which is a function from S^N to S (that is to say, for each possible state of the neighbourhood the transition rule specifies some cell state). The state of the cellular automaton evolves in discrete time, with the state of each cell at time t+1 being determined by the state of its neighbourhood at time t, in accordance with the transition rule. There are some variations on the above definition. It is common to require that there be a quiescent state, that is, a state such that if the whole universe is in that state at generation 0 then it will remain so in generation 1. (In Life the OFF state is quiescent, but the ON state is not.) Other variations allow spaces other than Z^n, neighbourhoods that vary over space and/or time, probabilistic or other non-deterministic transition rules, etc. It is common for the neighbourhood of a cell to be the 3x...x3 (hyper)cube centred on that cell. (This includes those cases where the neighbourhood might more naturally be thought of as a proper subset of this cube.) This is known as the Moore neighbourhood."
  },
  {
    "name": "census",
    "description": "A count of the number of different individual Life objects within one larger object, most often the final {ash} of a random {soup} experiment. This includes the number of {block}s, {blinker}s, {glider}s, and other common objects, as well as any rarer larger {still life}s, {oscillator}s or {spaceship}s."
  },
  {
    "name": "Centipede",
    "description": "The smallest known {31c/240} spaceship, constructed by Chris Cain in September 2014 as a refinement of the {shield bug}."
  },
  {
    "name": "channel",
    "description": "A {lane} or {signal} path used in construction circuitry. Until the invention of {single-channel} {construction arm}s, signals in a channel would usually be {synchronized} with one or more coordinated signals on other paths, as in the {Gemini}, which used twelve channels to run three construction arms simultaneously, or the 10hd {Demonoid} which needed only two channels. See also {Geminoid}."
  },
  {
    "name": "chaotic growth",
    "description": "An object whose {fate} is unknown, except that it appears to grow forever in an unpredictable manner. In Life, no pattern has yet been found that is chaotic. This is in contrast to many other Life-like rules, where even small objects can appear to grow chaotically. It is possible that chaotic growth may occur rarely or even regularly for large enough random Life objects, but if so the minimum size of such patterns must be larger than what can currently be experimentally simulated (but see {novelty generator}). In any case, it is not decidable whether a pattern that apparently grows randomly forever is in fact displaying chaotic growth. Continuing to evolve such a pattern might at any time result in it suddenly cleaning itself up and becoming predictable."
  },
  {
    "name": "chirality",
    "description": "A term borrowed from chemistry to describe asymmetrical patterns with two distinct mirror-image orientations. One common use is in relation to {Herschel transmitter}s, where the spacing between the two gliders in the {tandem glider} output can limit the {receiver} to a single chirality."
  },
  {
    "name": "circuit",
    "description": "Any combination of {conduit}s or {converter}s that moves or processes an active {signal}. This includes components with multiple states such as {period multiplier}s or {switch}es, which can be used to build {gun}s, logic gates, {universal constructor}s, and other computation or construction circuitry."
  },
  {
    "name": "clean",
    "description": "Opposite of {dirty}. A reaction which produces a small number of different products which are desired or which are easily deleted is said to be clean. For example, a {puffer} which produces just one object per period is clean. Clean reactions are useful because they can be used as building blocks in larger constructions. When a {fuse} is said to be clean, or to {burn} cleanly, this usually means that no debris at all is left behind."
  },
  {
    "name": "cloverleaf",
    "description": "This name was given by Robert Wainwright to his p2 oscillator {washing machine}. But Achim Flammenkamp also gave this name to {Achim's p4}."
  },
  {
    "name": "cluster",
    "description": "Any pattern in which each live cell is connected to every other live cell by a path that does not pass through two consecutive dead cells. This sense is due to Nick Gotts, but the term has also been used in other senses, often imprecise."
  },
  {
    "name": "CNWH",
    "description": "Conweh, creator of the Life universe."
  },
  {
    "name": "Collatz 5N+1 simulator",
    "description": "An {unknown fate} pattern constructed by David Bell in December 2017 that simulates the Collatz 5N+1 algorithm using {sliding block memory} and {p1} {technology}, while always having a population below 32000. The algorithm is simple. Starting with a number, if it is even divide it by 2, otherwise multiply it by 5 and add 1. When this process is iterated a sequence of numbers is generated. When starting with the value of 7, it is currently unknown whether or not the sequence ever forms a cycle. Because of this the fate of the simulator is also currently unknown. It may become stable, or become an oscillator with a high period, or have a bounding box which grows irregularly."
  },
  {
    "name": "colourised Life",
    "description": "A {cellular automaton} that is the same as Life except for the use of a number of different ON states (\"colours\"). All ON states behave the same for the purpose of applying the Life rule, but additional rules are used to specify the colour of the resulting ON cells. Examples are {Immigration} and {QuadLife}."
  },
  {
    "name": "composite conduit",
    "description": "A signal-processing {conduit} that can be subdivided into two or more {elementary conduit}s."
  },
  {
    "name": "constellation",
    "description": "A general term for a group of two or more separate objects, usually small still lifes and low-period oscillators. Compare {pseudo still life}."
  },
  {
    "name": "construction arm",
    "description": "An adjustable mechanism in a {universal constructor} that allows new objects to be constructed in any chosen location that the arm can reach. A construction arm generally consists of a {shoulder} containing fixed guns or edge shooters, a movable {construction elbow} that slides forward and backward along the {construction lane}(s), and in the case of {single-arm} universal constructors, a {hand} target object at the construction site that can be progressively modified by a {slow salvo} to produce each desired object."
  },
  {
    "name": "construction elbow",
    "description": "One of the components of a {construction arm} in a {universal constructor}. The elbow usually consists of a single {Spartan} still life or small constellation. It accepts {elbow operation} recipes, in the form of {salvo}s coming from the construction arm's {shoulder}. These recipes may do one of several things: 1) {pull} the elbow closer to the shoulder, 2) {push} the elbow farther from the shoulder, 3) emit a glider on a particular output {lane} (while also optionally pushing or pulling the elbow); 4) create a \"{hand}\" target block or other useful object as a target for output gliders, to one side of the {construction lane}; 5) duplicate the elbow, or 6) destroy the elbow. Elbows that receive and emit orthogonally-travelling {spaceship}s instead of gliders are technically possible, but no working examples are currently known. The discussion below assumes that gliders are used to communicate between the shoulder, elbow, and hand locations. If a mechanism can be programmed to generate recipes for at least the first three options listed above, it is generally capable of functioning as a {universal constructor}. The main requirement is that push and pull {elbow operation}s should be available that are either minimal (1{fd}) or the distances should be relatively prime. Depending on the {elbow operation} library, there may be only one type of elbow, or there may be two or more elbow objects, with recipes that convert between them. The {9hd} library had just one elbow type, a block. The original 10{hd} library had two elbows, blocks in mirror-symmetric locations; this was expanded to a larger list for the {10hd Demonoid}. The {0hd Demonoid} also has a multi-elbow recipe library. A {slow elbow} toolkit may make use of an even larger number of glider output recipes, because the {target} elbow object in that case is not restricted to a single diagonal line. If only one colour, parity, or phase of glider can be emitted, then the mechanism will be limited to producing {monochromatic salvo}s or {monoparity salvo}s. These are less efficient at most construction tasks, but are still generally accepted to enable {universal toolkit}s. See also {half-baked knightship}."
  },
  {
    "name": "construction envelope",
    "description": "The region affected by an active reaction, such as a {glider synthesis} of an object. The envelope corresponds to the state-2 blue cells in {LifeHistory}. See also {edgy}."
  },
  {
    "name": "construction lane",
    "description": "Part of a {construction arm} between the {shoulder} and the {elbow} - in particular, one of the fixed {lane}s that {elbow operation} signals travel on. All known {universal constructor}s have used arms with two or more construction lanes, except for the ones in the {0hd Demonoid} and in recent {single-channel} construction recipes."
  },
  {
    "name": "construction recipe",
    "description": "One or more streams of {glider}s or other signals fed into a {universal constructor} to create a target object. Compare {glider recipe}."
  },
  {
    "name": "convoy",
    "description": "A collection of {spaceship}s all moving in the same direction at the same speed. Convoys are usually not destroyed by the reactions that they cause. Compare {salvo}. For examples, see {reanimation}, {fly-by deletion} and {glider turner}."
  },
  {
    "name": "Corder-",
    "description": "Prefix used for things involving {switch engine}s, after Charles Corderman."
  },
  {
    "name": "Cordergun",
    "description": "A {gun} firing {Cordership}s. The first was built by Jason Summers in July 1999, using a {glider synthesis} by Stephen Silver."
  },
  {
    "name": "de Bruijn graph",
    "description": "As applied to Life, a de Bruijn graph is a graph showing which pieces can be linked to which other pieces to form a valid part of a Life pattern of a particular kind. For example, if we are interested in {still life}s, then we could consider 2x3 rectangular pieces and the de Bruijn graph would show which pairs of these can be overlapped to form 3x3 squares in which the centre cell remains unchanged in the next generation. David Eppstein's {search program} {gfind} is based on de Bruijn graphs."
  },
  {
    "name": "Deep Cell",
    "description": "A pattern by Jared James Prince, based on David Bell's {unit Life cell}, in which each unit cell simulates two Life cells, in such a way that a Life universe filled with Deep Cells simulates two independent Life universes running in parallel. In fact, a Life universe filled with Deep Cells can simulate infinitely many Life universes, as follows. Let P_1, P_2, P_3, ... be a sequence of Life patterns. Set the Deep Cells to run a simulation of P_1 in parallel with a simulation of a universe filled with Deep Cells, with these simulated Deep Cells running a simulation of P_2 in parallel with another simulation of a universe filled with Deep Cells, with these doubly simulated Deep Cells simulating P_3 in parallel with yet another universe of Deep Cells, and so on. Deep Cell is available from {http://psychoticdeath.com/life.htm}."
  },
  {
    "name": "Demonoid",
    "description": "The first {self-constructing} diagonal spaceship. A 0{hd} Demonoid was completed by Chris Cain in December 2015, shortly after a much larger 10hd version was constructed the previous month in collaboration with Dave Greene. The 0hd spaceship fits in a bounding box about 55,000 cells square, and displaces itself by 65 cells diagonally every 438,852 generations. The first 0hd Demonoid was fired by a {gun}. No spaceship gun pattern had previously been completed before the first appearance of the actual spaceship. In June 2017 Dave Greene completed a much simpler {single-channel} Demonoid using a temporary {lossless elbow}, which displaces itself 79 cells diagonally every 1,183,842 ticks. This was an improvement in terms of design complexity, but not in terms of speed, population, or bounding box. However, all of these could be further optimized. A smaller Hashlife-friendly single-channel Demonoid design was completed in 2018."
  },
  {
    "name": "density",
    "description": "The density of a pattern is the limit of the proportion of live cells in a (2n+1)x(2n+1) square centred on a particular cell as n tends to infinity, when this limit exists. (Note that it does not make any difference what cell is chosen as the centre cell. Also note that if the pattern is finite then the density is zero.) There are other definitions of density, but this one will do here. In 1994 Noam Elkies proved that the maximum density of a stable pattern is 1/2, which had been the conjectured value. See the paper listed in the bibliography. Marcus Moore provided a simpler proof in 1995, and in fact proves that a {still life} with an m x n {bounding box} has at most (mn+m+n)/2 cells. But what is the maximum average density of an oscillating pattern? The answer is conjectured to be 1/2 again, but this remains unproved. The best upper bound so far obtained is 8/13 (Hartmut Holzwart, September 1992). The maximum possible density for a {phase} of an oscillating pattern is also unknown. An example with a density of 3/4 is known (see {agar}), but densities arbitrarily close to 1 may perhaps be possible."
  },
  {
    "name": "dependent conduit",
    "description": "A {Herschel conduit} in which the input {Herschel} interacts with catalysts in the first few ticks. The standard interaction actually starts at T=-3, before the Herschel is completely formed. Compare {independent conduit}. The Herschel is prevented from emitting its {first natural glider}. This is useful in cases where the previous conduit cannot survive a first natural glider emitted from its output Herschel. This term is somewhat confusing, since it is actually the previous conduit that depends on the dependent conduit to suppress the problematic glider. Dependent conduits such as the {F166} and {Lx200} do not actually depend on anything. They can be freely connected to any other conduits that fit, as long as the output Herschel evolves from its standard great-grandparent. As of this writing, the {Fx158} is the only known case where a conduit's output Herschel has an alternate great-grandparent, which is incompatible with dependent conduits' initial transparent block."
  },
  {
    "name": "destructive read",
    "description": "The most common type of test reaction in {memory cell} circuitry. Information is stored in a memory cell by placing objects in known positions, or by changing the state of a stable or periodic {toggle circuit}. A destructive-read test consists of sending one or more {signal}s to the memory cell. A distinct output signal is produced for each possible state of the memory cell, which is reset to a known \"zero\" or \"rest\" state. See for example {boat-bit}, {keeper}, and {demultiplexer}. To permanently store information in a destructive-read memory cell, the output signal(s) must be used, in part, to send appropriate signals back to the memory cell to restore its state to its previous value. With output looped back to input, this larger composite circuit then effectively becomes a {non-destructive read} memory cell."
  },
  {
    "name": "destructor arm",
    "description": "A dedicated {construction arm} in the {Gemini} spaceship, used only for removing previously active {circuit}ry once it is no longer needed. More generally, any circuitry in a self-constructing pattern dedicated exclusively to cleanup."
  },
  {
    "name": "dirty",
    "description": "Opposite of {clean}. A reaction which produces a large amount of complicated junk which is difficult to control or use is said to be dirty. Many basic {puffer engine}s are dirty and need to be {tame}d by accompanying {spaceship}s in order to produce clean output. Similarly, a dirty {conduit} is one that does not recover perfectly after the passage of a {signal}; one or more extra {ash} objects are left behind (or more rarely a {catalyst} is damaged) and additional signals must be used to clean up the circuit before it can be re-used."
  },
  {
    "name": "domino",
    "description": "The 2-cell {polyomino}. A number of objects, such as the {HWSS} and {pentadecathlon}, produce domino {spark}s."
  },
  {
    "name": "dormant",
    "description": "An object that is either stable or oscillates without producing any output, until it is {trigger}ed by an appropriate signal, which then produces some desired action. For example, {freeze-dried} objects are dormant until the arrival of a particular glider."
  },
  {
    "name": "dr",
    "description": "Short identifier for Dean Hickerson's 'drifter' search program, used at various times to find {wire}s, {eater}s, higher-period {billiard table configuration}s, and related {signal}-carrying and signal-processing mechanisms. See also {drifter}."
  },
  {
    "name": "drifter",
    "description": "A perturbation moving within a stable pattern. Dean Hickerson has written a {search program} to search for drifters, with the hope of finding one which could be moved around a track. Because drifters can be very small, they could be packed more tightly than {Herschel}s, and so allow the creation of {oscillator}s of periods not yet attained, and possibly prove that Life is {omniperiodic}. Hickerson has found a number of components towards this end, but it has proved difficult to change the direction of movement of a drifter, and so far no complete track has been found. However, Hickerson has had success using the same program to find {eater}s with novel properties, such as {sparking eater}s and the ones shown in {diuresis}."
  },
  {
    "name": "early universe",
    "description": "Conway's somewhat confusing term for {sparse Life}."
  },
  {
    "name": "edge spark",
    "description": "A {spark} at the side of a {spaceship} that can be used to {perturb} things as the spaceship passes by."
  },
  {
    "name": "edge sparker",
    "description": "A {spaceship} that produces one or more {edge spark}s."
  },
  {
    "name": "edgy",
    "description": "In {slow salvo} terminology, an edgy glider construction recipe is one that places its final product at or very near the edge of its {construction envelope}. Similarly, an edgy {factory} will place its output object in an accessible location near the edge of its {reaction envelope}."
  },
  {
    "name": "elbow",
    "description": "Depending on context, this term may refer to a {signal elbow} or a {construction elbow}. See also {elbow ladder}."
  },
  {
    "name": "elbow ladder",
    "description": "Scot Ellison's name for the type of pattern he created in which one or more {glider}s shuttle back and forth (using the {kickback reaction}) deleting the output gliders from a pair of {slide gun}s."
  },
  {
    "name": "elbow operation",
    "description": "A recipe, usually a {salvo} of {glider}s travelling on one or more {construction lane}s, that collides with an {elbow} {constellation} and performs one of the standard transformations on it: {push}, {pull}, or {fire} for simple construction arms, along with possible construct, duplicate-elbow, or delete-elbow ops for more complicated systems. See {construction elbow}."
  },
  {
    "name": "elementary",
    "description": "Not reducible to a combination of smaller parts. Elementary {spaceship}s in particular are usually those found by search programs, and they can't be subdivided into smaller spaceships, tagalongs, and supporting reactions, as contrasted with engineered {macro-spaceship}s."
  },
  {
    "name": "elementary conduit",
    "description": "A {conduit} with no recognizable active signal stage besides its input and output. An early example still very commonly used is Buckingham's {BFx59H}, which transforms a {B-heptomino} into an inverted {Herschel} in 59 ticks. The BFx59H elementary conduit is a component in many of the original {universal} {toolkit} of Herschel conduits. An extension of the same naming convention is used for elementary conduits, with the first and last letters of the name specifying the input and output {signal} objects. As with Herschels, an arbitrary orientation and center point is chosen for each object. \"Fx\" means the signal moves forward and produces a mirror-image output. See {Herschel conduit} for further details. Theoretically an elementary conduit may become a composite conduit, if another conduit can be found that shares the beginning or end of the conduit in question. In practice this happens only rarely, because many of the most likely branch points have already been identified: {glider} (G), {LWSS} (L) or {MWSS} (M), {Herschel} (H), {B-heptomino} (B), {R-pentomino} (R), {pi-heptomino} (P), {queen bee shuttle} (Q), {century} or {bookend} (C), {dove} (D), and {wing} (W). A {Herschel descendant} might qualify, due to the elementary conduit that can be seen in the {p184 gun}. However, there are very few simple conduits that produce Herschel descendants without Herschels, so in practice this is not a useful branch point."
  },
  {
    "name": "emu",
    "description": "Dave Buckingham's term for a {Herschel loop} that does not emit {glider}s (and so is \"flightless\"). All known Herschel loops of periods 52, 57, 58, 59 and 61 are emus. See also {Quetzal}."
  },
  {
    "name": "emulator",
    "description": "Any one of three p4 oscillators that produce {spark}s similar to those produced by {LWSS}, {MWSS} and {HWSS}. See {LW emulator}, {MW emulator} and {HW emulator}. Larger emulators are also possible, but they require stabilizing objects to suppress their {non-spark}s and so are of little use. The emulators were discovered by Robert Wainwright in June 1980."
  },
  {
    "name": "engine",
    "description": "The active portion of an object (usually a {puffer} or {gun}) which is considered to actually produce its output, and which generally permits no variation in how it works. The other parts of the object are just there to support the engine. For examples, see {puffer train}, {Schick engine}, {blinker puffer}, {frothing puffer} and {line puffer}."
  },
  {
    "name": "engineless",
    "description": "A {rake} or {puffer} which does not contain a specific {engine} for its operation. Instead it depends on perturbations of gliders or other objects by passing spaceships. The period of such objects is often adjustable, and in some cases the speed as well. An early example was the creation of c/5 rakes in September 1997, using gliders circulating among a convoy of c/5 spaceships. More recently, the passing spaceships themselves are also constructed, as in the {Caterloopillar}."
  },
  {
    "name": "evolution",
    "description": "The process or result of running one or more generations of an object. For example, a row of 10 cells evolves into a {pentadecathlon}."
  },
  {
    "name": "evolutionary factor",
    "description": "For an unstable pattern, the time to stabilization divided by the initial {population}. For example, the {R-pentomino} has an evolutionary factor of 220.6, while {bunnies} has an evolutionary factor of 1925.777... The term is no longer in use."
  },
  {
    "name": "exhaust",
    "description": "The debris or {smoke} left behind by a {puffer}, especially if the debris is {dirty} and takes many {generation}s to settle. The term is not usually used for the objects created by {clean} puffers."
  },
  {
    "name": "exponential filter",
    "description": "A {toolkit} developed by Gabriel Nivasch in 2006, enabling the construction of patterns with asymptotic population growth matching O((log log ... log(t))) for any number of nested log operations. See also {quadratic filter}, {recursive filter}."
  },
  {
    "name": "extensible",
    "description": "A pattern is said to be extensible if arbitrarily large patterns of the same type can be made by repeating parts of the original pattern in a regular way. For examples, see {p6 shuttle}, {pentoad}, {pufferfish spaceship}, {snacker}, {wavestretcher}, {wicktrailer} and {branching spaceship}."
  },
  {
    "name": "familiar fours",
    "description": "Common patterns of four identical objects. The five commonest are {traffic light} (4 blinkers), {honey farm} (4 beehives), {blockade} (4 blocks), {fleet} (4 ships, although really 2 ship-ties) and {bakery} (4 loaves, although really 2 bi-loaves). Also sometimes included is {four skewed blocks}."
  },
  {
    "name": "fanout",
    "description": "A mechanism that emits two or more objects of some type for each one that it receives. Typically the objects are {glider}s or {Herschel}s; {glider duplicator}s are a special case."
  },
  {
    "name": "fate",
    "description": "The result of evolving a pattern until its final behaviour is known. This answers such questions such as whether or not the pattern remains finite, what its growth rate is, what {period} the final state may settle into, and what its final {census} is. All small Life objects seem to eventually settle down into a mix of oscillators, simple spaceships, and occasionally small puffers. See {methuselah}, {soup}, {ash}. Most sufficiently large random patterns are expected to grow forever due to the production of {switch engine}s at their boundary. Engineered Life objects - and therefore also sufficiently large and unlikely random patterns - can have more interesting behaviour, such as {breeder}s, {sawtooth}s, and prime calculators. Some objects have even been constructed or designed having an {unknown fate}."
  },
  {
    "name": "fd",
    "description": "Abbreviation for {full diagonal}s."
  },
  {
    "name": "fencepost",
    "description": "Any pattern that stabilizes one end of a {wick}."
  },
  {
    "name": "Fermat prime calculator",
    "description": "A pattern constructed by Jason Summers in January 2000 that exhibits {infinite growth} if and only if there are no Fermat primes greater than 65537. The question of whether or not it really does exhibit infinite growth is therefore equivalent to a well-known and long-standing unsolved mathematical problem. It will, however, still be growing at generation 10^2585827975. The pattern is based on Dean Hickerson's {primer} and {caber tosser} patterns and a p8 {beehive} {puffer} by Hartmut Holzwart."
  },
  {
    "name": "finger",
    "description": "A protruding cell in an {oscillator} or {dying spark}, with the ability to modify a nearby active reaction. Like a {thumb}, a finger cell appears at the edge of a reaction envelope and is the only live cell in its row or column. The finger spark remains alive for two ticks before dying, whereas a thumb cell dies after one tick. Because the key cell is kept alive for an extra tick, an alternate technical term is \"held (orthogonal) bit spark\". A \"held diagonal bit spark\" is not possible in B3/S23 for obvious reasons."
  },
  {
    "name": "fire",
    "description": "An encoded signal used in combination with {push} and {pull} {elbow operation}s in a simple {construction arm}. When a FIRE signal is sent, the construction-arm elbow produces an output glider, usually at 90 degrees from the construction arm. This terminology is generally used when there is only a single recipe for such a glider output, or only one recipe for each glider colour (e.g., FIRE WHITE, FIRE BLACK)."
  },
  {
    "name": "first natural glider",
    "description": "The glider produced at T=21 during the {evolution} of a {Herschel}. This is the most common signal output from a {Herschel conduit}."
  },
  {
    "name": "fish",
    "description": "A generic term for {LWSS}, {MWSS} and {HWSS}, or, more generally, for any {spaceship}. In recent years {*WSS} is much more commonly used to refer to the small orthogonal c/2 spaceships."
  },
  {
    "name": "flip-flop",
    "description": "Any p2 {oscillator}. However, the term is also used in two more specific (and non-equivalent) senses: (a) any p2 oscillator whose two {phase}s are mirror images of one another, and (b) any p2 oscillator in which all {rotor} cells die from {underpopulation}. In the latter sense it contrasts with {on-off}. The term has also been used even more specifically for the 12-cell flip-flop shown under {phoenix}."
  },
  {
    "name": "flip-flops",
    "description": "Another name for the flip-flop shown under {phoenix}."
  },
  {
    "name": "flipper",
    "description": "Any {oscillator} or {spaceship} that forms its mirror image halfway through its period."
  },
  {
    "name": "forward glider",
    "description": "A {glider} which moves at least partly in the same direction as the {puffer}(s) or {spaceship}(s) under consideration."
  },
  {
    "name": "freeze-dried",
    "description": "A term used for a {glider constructible} {seed} that can activated in some way to produce a complex object. For example, a \"freeze-dried salvo\" is a constellation of constructible objects which, when {trigger}ed by a single glider, produces a unidirectional glider {salvo}, and nothing else. Freeze-dried salvos can be useful in {slow salvo} constructions, especially when an active circuit has to destroy or reconstruct itself in a limited amount of time. Gradual modification by a {construction arm} may be too slow, or the circuit doing the construction may itself be the object that must be modified. The concept may be applied to other types of objects. For example, one possible way to build a gun for a {waterbear} would be to program a construction arm to build a freeze-dried waterbear seed, and then trigger it when the construction is complete."
  },
  {
    "name": "full diagonal",
    "description": "Diagonal distance measurement, abbreviated \"fd\", often appropriate when a {construction arm} {elbow} or similar diagonally-adjustable mechanism is present."
  },
  {
    "name": "Game of Life News",
    "description": "A blog reporting on new Life discoveries, started by Heinrich Koenig in December 2004, currently found at {http://pentadecathlon.com/lifenews/}."
  },
  {
    "name": "Gemini",
    "description": "c/33699586 obliquely, p33699586) The first {self-constructing} spaceship, and also the first {oblique} spaceship. It was made public by Andrew Wade on 18 May 2010. It was the thirteenth explicitly constructed spaceship velocity in Life, and made possible an infinite family of related velocities. The Gemini spaceship derives its name from the Latin \"gemini\", meaning twins, describing its two identical halves, each of which contains three Chapman-Greene {construction arm}s. A tape of gliders continually relays between the two halves, instructing each to delete its parent and construct a daughter configuration."
  },
  {
    "name": "Geminoid",
    "description": "A type of self-constructing circuitry that borrows key ideas from Andrew Wade's {Gemini} spaceship, but with several simplifications. The main feature common to the Gemini spaceship is the construction recipe encoding method. Information is stored directly, and much more efficiently, in the timings of moving gliders, rather than in a static tape with 1s and 0s encoded by the presence of small stationary objects. Unlike the original Gemini, Geminoids have {ambidextrous} construction arms, initially using glider pairs on two lanes separated by 9{hd}, 10hd, or 0hd. The design was the basis for the {linear propagator} and the {Demonoid}s. A more recent development is a Geminoid toolkit using a {single-channel} construction arm, which allows for the possibility of multiple elbows with no loss of efficiency, or the construction of temporary lossless elbows. Compare {slow elbow}. Other new developments that could be considered part of the extended \"Geminoid\" toolkit include {freeze-dried} construction salvos and seeds, used when objects must be built within a short time window, and self-destruct circuits, which are used as an alternative to a {destructor arm} to clean up temporary objects in a similarly short window."
  },
  {
    "name": "generation",
    "description": "The fundamental unit of time. The starting pattern is generation 0."
  },
  {
    "name": "gfind",
    "description": "A program by David Eppstein which uses {de Bruijn graph}s to search for new {spaceship}s. It was with gfind that Eppstein found the {weekender}, and Paul Tooke later used it to find the {dragon}. It is available at {http://www.ics.uci.edu/~eppstein/ca/gfind.c} (C source code only). Compare {lifesrc}."
  },
  {
    "name": "glider gun",
    "description": "A {gun} that fires {glider}s. For examples, see {Gosper glider gun}, {Simkin glider gun}, {new gun}, {p45 gun}. True-period glider guns are known for some low periods, and for all periods over 53 using {Herschel conduit} {technology}. See {true} for a list of known true-period guns. The lowest true-period gun possible is the {p14 gun} since that is the lowest possible period for any glider {stream}, but no example has yet been found. Pseudo-period glider guns are known for every period above 13. These are made by using multiple true-period guns of some multiple of the period, and glider {inject}ion methods to fill in the gaps."
  },
  {
    "name": "glider pair",
    "description": "Two gliders travelling in the same direction with a specific spacetime offset. In a {transceiver} the preferred term is {tandem glider}. For several years, glider pairs on {lane}s separated by 9 or 10 {half diagonal}s were the standard building blocks in {Geminoid} {construction arm} {recipe}s. In more recent 0hd and {single-channel} construction toolkits, all gliders share the same lane, but glider pairs and {singleton}s are still important concepts."
  },
  {
    "name": "glide symmetric",
    "description": "Undergoing simultaneous reflection and translation. A glide symmetric {spaceship} is sometimes called a {flipper}."
  },
  {
    "name": "Gn",
    "description": "An abbreviation specific to {converter}s that produce multiple {glider}s. A \"G\" followed by any integer value means that the converter produces a {tandem glider} - two parallel glider outputs with lanes separated by the specified number of {half diagonal}s."
  },
  {
    "name": "Golly",
    "description": "A cross-platform open source Life program by Andrew Trevorrow and Tomas Rokicki. Unlike most Life programs it includes the ability to run patterns using the {hashlife} algorithm. It is available from {http://golly.sourceforge.net}."
  },
  {
    "name": "Gotts dots",
    "description": "A 41-cell 187x39 {superlinear growth} pattern found by Bill Gosper in March 2006, who named it in honour of Nick Gotts, discoverer of many other low-population superlinear patterns, such as {Jaws}, the {mosquito}es, {teeth}, {catacryst} and {metacatacryst}. See {switch-engine ping-pong} for the lowest-population {superlinear growth} pattern as of July 2018, along with a list of the record-holders. Collisions within the pattern cause it to sprout its Nth {switch engine} at generation T = ~224n-6. The population of the pattern at time t is asymptotically proportional to t times log(t), so the growth rate is O(t ln(t)), faster than {linear growth} but slower than {quadratic growth}."
  },
  {
    "name": "grammar",
    "description": "A set of rules for connecting {component}s together to make an object such as a {spaceship}, {oscillator} or {still life}. For example, in August 1989 Dean Hickerson found a grammar for constructing an infinite number of short wide c/3 period 3 spaceships, using 33 different components and a table showing the ways that they can be joined together."
  },
  {
    "name": "grandfatherless",
    "description": "A traditional name for a pattern with one or more {parent}s but no grandparent. This was a hypothetical designation until May 2016. See {grandparent} for details."
  },
  {
    "name": "grandparent",
    "description": "A pattern is said to be a grandparent of the pattern it gives rise to after two generations. For over thirty years, a well-known open problem was the question of whether any pattern existed that had a parent but no grandparent. In 1972, {LifeLine} Volume 6 mentioned John Conway's offer of a $50 prize for a solution to the problem, but it remained open until May 2016 when a user with the conwaylife.com forum handle 'mtve' posted an example. Other patterns have since been found that have a grandparent but no great-grandparent, or a great-grandparent but no great-great-grandparent. Further examples in this series almost certainly exist, but as of July 2018 none have yet been found."
  },
  {
    "name": "grey ship",
    "description": "A {spaceship} that contains a region with an average density of 1/2, and which is {extensible} in such a way that the region of average density 1/2 can be made larger than any given square region. See also {with-the-grain grey ship}, {against-the-grain grey ship} and {hybrid grey ship}."
  },
  {
    "name": "growing/shrinking line ship",
    "description": "A {line ship} in which the line repeatedly grows and shrinks, resulting in a high-period {spaceship}."
  },
  {
    "name": "growing spaceship",
    "description": "An object that moves like a {spaceship}, except that its front part moves faster than its back part and a {wick} extends between the two. Put another way, a growing spaceship is a {puffer} whose output is burning {clean}ly at a slower rate than the puffer is producing it. Examples include {blinker ship}s, {pi ship}s, and some {wavestretcher}s."
  },
  {
    "name": "G-to-H",
    "description": "A {converter} that takes a {glider} as an input {signal} and produces a {Herschel} output, which can then be used by other {conduit}s. G-to-Hs are frequently used in {stable} logic circuitry. Early examples include {Callahan G-to-H}, {Silver G-to-H}, and {p8 G-to-H} for periodic circuits. A more compact recent example is the {syringe}."
  },
  {
    "name": "gun",
    "description": "Any stationary pattern that emits {spaceship}s (or {rake}s) forever. For examples see {double-barrelled}, {edge shooter}, {factory}, {gliderless}, {Gosper glider gun}, {Simkin glider gun}, {new gun} and {true}."
  },
  {
    "name": "gunstar",
    "description": "Any of a series of glider {gun}s of period 144+72n (for all non-negative integers n) constructed by Dave Buckingham in 1990 based on his {transparent block reaction} and Robert Wainwright's p72 oscillator (shown under {factory})."
  },
  {
    "name": "gutter",
    "description": "A single straight line of cells along the axis of symmetry of a mirror-{symmetric} pattern. Most commonly this is an orthogonal line, and the pattern is then odd-symmetric (as opposed to even-symmetric, where the axis of symmetry follows the boundary between two rows or columns of cells). The birth rule for Conway's Life trivially implies that if there are no live cells in the gutter of a symmetric pattern, new cells can never be born there. For examples, see {44P5H2V0}, {60P5H2V0}, {Achim's p4}, {brain}, {c/6 spaceship}, {centinal}, {p54 shuttle}, {pufferfish}, {snail}, {spider}, and {pulsar} (in two orientations)."
  },
  {
    "name": "half-baked knightship",
    "description": "c/2621440, p2621440) A {self-supporting} {macro-spaceship} with adjustable period but fixed direction, based on the {half-bakery reaction}. This was the first spaceship based on this reaction, constructed in December 2014 by Adam P. Goucher. It moves 6 cells horizontally and 3 cells vertically every 2621440+8N ticks, depending on the relative spacing of the two halves. It is one of the slowest known {knightship}s, and the first one that was not a {Geminoid}. Chris Cain optimized the design a few days later to create the {Parallel HBK}. The spaceship produces gliders from near-diagonal lines of half-bakeries, which collide with each other at 180 degrees. These collisions produce {monochromatic salvo}s that gradually build and trigger {seed}s, which in turn eventually construct small {synchronized} {salvo}s of gliders. These re-activate the lines of half-bakeries, thus closing the cycle and moving the entire spaceship obliquely by (6,3)."
  },
  {
    "name": "half diagonal",
    "description": "A natural measurement of distance between parallel glider lanes, or between {elbow} locations in a {universal} {construction arm} {elbow operation} library. If two gliders are in the same phase and exactly lined up vertically or horizontally, N cells away from each other, then the two glider {lane}s are considered to be N half diagonals (hd) apart. Gliders that are an integer number of {full diagonal}s apart must be the same colour, whereas integer {half diagonal}s allow for both glider colours. See {colour of a glider}, {linear propagator}."
  },
  {
    "name": "Halfmax",
    "description": "A pattern that acts as a spacefiller in half of the Life plane, found by Jason Summers in May 2005. It expands in three directions at c/2, producing a triangular region that grows to fill half the plane."
  },
  {
    "name": "hand",
    "description": "Any object used as a {slow salvo} {target} by a {construction arm}."
  },
  {
    "name": "hashlife",
    "description": "A Life algorithm by Bill Gosper that is designed to take advantage of the considerable amount of repetitive behaviour in many large patterns of interest. It provides a means of evolving repetitive patterns millions (or even billions or trillions) of generations further than normal Life algorithms can manage in a reasonable amount of time. The hashlife algorithm is described by Gosper in his paper listed in the bibliography at the end of this lexicon. Roughly speaking, the idea is to store subpatterns in a hash table so that the results of their {evolution} do not need to be recomputed if they arise again at some other place or time in the evolution of the full pattern. This does, however, mean that complex patterns can require substantial amounts of memory. Tomas Rokicki and Andrew Trevorrow implemented Hashlife into {Golly} in 2005. See also {macrocell}."
  },
  {
    "name": "hassler",
    "description": "An {oscillator} that works by hassling (repeatedly moving or changing) some object. For some examples, see {Jolson}, {baker's dozen}, {toad-flipper}, {toad-sucker} and {traffic circle}. Also see {p24 gun} for a good use of a {traffic light} {hassler}."
  },
  {
    "name": "hd",
    "description": "Abbreviation for {half diagonal}. This metric is used primarily for relative measurements of glider lanes, often in relation to {self-constructing} circuitry; compare {Gn}."
  },
  {
    "name": "heat",
    "description": "For an {oscillator} or {spaceship}, the average number of cells which change state in each generation. For example, the heat of a {glider} is 4, because 2 cells are born and 2 die every generation. For a period n oscillator with an r-cell {rotor} the heat is at least 2r/n and no more than r(1-(n mod 2)/n). For n=2 and n=3 these bounds are equal."
  },
  {
    "name": "heptaplet",
    "description": "Any 7-cell {polyplet}."
  },
  {
    "name": "heptomino",
    "description": "Any 7-cell {polyomino}. There are 108 such objects. Those with names in common use are the {B-heptomino}, the {Herschel} and the {pi-heptomino}."
  },
  {
    "name": "Herschel circuit",
    "description": "A series of {Herschel conduit}s or other components, connected by placing them so that the output {Herschel}s from early conduits become the input Herschels for later conduits. Often the initial component is a {converter} accepting some other signal type as input - usually a glider, in which case a {syringe} is most commonly used. The {Silver reflector} is a well-known early {Spartan} Herschel circuit from before the syringe was discovered, where the initial converter is a {Callahan G-to-H}. Sometimes a direct connection between two conduits is not possible due to unwanted gliders that destroy required {catalyst}s, or wanted gliders that are not able to escape. In this case, small \"spacer\" conduits such as {F116}, {F117}, {Fx77}, {R64}, {L112}, or {L156} can be inserted between the other conduits to solve the problem. Some converter or {factory} conduits do not produce a Herschel as output, instead generating other useful results such as gliders, {boat}s or {MWSS}es. See {Herschel-to-glider}, {demultiplexer}, and {H-to-MWSS} respectively for examples of these. For those conduits which do produce an unwanted Herschel, an {eater} such as {SW-2} can be added to delete it. If the first and last conduits of a chain connect to each other in a loop then there is no need for a syringe to generate the first Herschel, or an eater to consume the last one. The circuit becomes a self-supporting {Herschel loop}. A loop is also formed by a {syringe} connected to a Herschel-to-glider converter, with the glider reflected back to the syringe's input with glider reflectors of the appropriate colour, usually {Snark}s. In either case, if the loop has a surplus {glider} output, it becomes a {gun}; if no output is available it is an {emu}."
  },
  {
    "name": "Herschel climber",
    "description": "Any {reburnable fuse} reaction involving {Herschel}s. May refer specifically to the {(23,5)c/79 Herschel climber} used in the {waterbear}, or one of several similar reactions with various velocities. See also {Herschel-pair climber}."
  },
  {
    "name": "Herschel conduit",
    "description": "A {conduit} that moves a {Herschel} from one place to another. See also {Herschel loop}. Well over a hundred simple stable Herschel conduits are currently known. As of June 2018 the number is approximately 150, depending on the precise definition of \"simple\" - e.g., fitting inside a 100x100 bounding box, and producing output in no more than 300 {tick}s. In general a Herschel conduit can be called \"simple\" if its active reaction does not return to a Herschel stage except at its output. Compare {elementary conduit}, {composite conduit}. A description of common usage in complex circuitry, using {syringe}s and {Snark}s to make compact connections, can be found in {Herschel circuit}. The original {universal} set consisted of sixteen stable Herschel conduits, discovered between 1995 and 1998 by Dave Buckingham (DJB) and Paul Callahan (PBC). These are shown in the following table. In this table, the number in \"name/steps\" is the number of {tick}s needed to produce an output Herschel from the input Herschel. \"m\" tells how the Herschel is moved (R = turned right, L = turned left, B = turned back, F = unturned, f = flipped), and \"dx\" and \"dy\" give the displacement of the centre cell of the Herschel (assumed to start in the orientation shown above). ----------------------------------------- name/steps m dx dy discovery ----------------------------------------- {R64} R 11 9 DJB, Sep 1995 {Fx77} Ff 25 -8 DJB, Aug 1996 {L112} L 12 -33 DJB, Jul 1996 {F116} F 32 1 PBC, Feb 1997 {F117} F 40 -6 DJB, Jul 1996 {Bx125} Bf -9 -17 PBC, Nov 1998 {Fx119} Ff 20 14 DJB, Sep 1996 {Fx153} Ff 48 -4 PBC, Feb 1997 {L156} L 17 -41 DJB, Aug 1996 {Fx158} Ff 27 -5 DJB, Jul 1996 {F166} F 49 3 PBC, May 1997 {Fx176} Ff 45 0 PBC, Oct 1997 {R190} R 24 16 DJB, Jul 1996 {Lx200} Lf 17 -40 PBC, Jun 1997 {Rx202} Rf 7 32 DJB, May 1997 {Bx222} Bf -6 -16 PBC, Oct 1998 ----------------------------------------- See also {Herschel transceiver}."
  },
  {
    "name": "Herschel loop",
    "description": "A cyclic {Herschel track}. Although no loop of length less than 120 generations has been constructed it is possible to make {oscillator}s of smaller periods by putting more than one Herschel in a higher-period track. In this way oscillators, and in most cases {gun}s, of all periods from 54 onwards can now be constructed (although the p55 case is a bit strange, shooting itself with gliders in order to stabilize itself). A mechanism for a period-52 loop was found in April 2018, but it includes a stage where the signal is carried by a triplet of {glider}s so it may not be considered to be a pure Herschel loop. The missing period, 53, is a difficult case simply because 53 is prime and so no small sparkers or reflectors are available. See {Simkin glider gun} and {p256 gun} for the smallest known Herschel loops. See also {emu} and {omniperiodic}."
  },
  {
    "name": "Herschel-pair climber",
    "description": "Any {reburnable fuse} reaction involving pairs of {Herschel}s. May refer specifically to the {31c/240 Herschel-pair climber} used in the {Centipede}, or one of several similar reactions with various velocities. See also {Herschel climber}."
  },
  {
    "name": "Herschel-to-glider",
    "description": "The largest category of {elementary conduit}. Gliders are very common and self-supporting, so it's much easier to find these than any other type of output {signal}. A large collection of these H-to-G {converter}s has been compiled, with many different output {lane}s and timings. These can be used to synchronize multiple signals to produce {gun} patterns or complex logic circuitry. See {NW31T120} for an example."
  },
  {
    "name": "Herschel track",
    "description": "A {track} for {Herschel}s. An equivalent term is {Herschel circuit}. See also {B track}."
  },
  {
    "name": "Herschel transceiver",
    "description": "An adjustable {Herschel conduit} made up of a {Herschel transmitter} and a {Herschel receiver}. The intermediate stage consists of a {tandem glider} - two {glider}s on parallel {lane}s - so that the transmitter and receiver can be separated by any required distance. The conduit may be {stable}, or may contain low-period {oscillator}s."
  },
  {
    "name": "hexaplet",
    "description": "Any 6-cell {polyplet}."
  },
  {
    "name": "hexomino",
    "description": "Any 6-cell {polyomino}. There are 35 such objects. For some examples see {century}, {stairstep hexomino}, {table}, {toad} and {Z-hexomino}."
  },
  {
    "name": "high-bandwidth telegraph",
    "description": "A variant of the {telegraph} constructed by Louis-Francois Handfield in February 2017, using periodic components to achieve a transmission rate of one bit per 192 ticks. The same ten signals are sent as in the original {telegraph} and the {p1 telegraph}, but information is encoded more efficiently in the timing of those signals. Specifically, the new transmitter sends five bits every 960 ticks by adjusting the relative timings inside each of the five mirror-image paired subunits of the composite signal in the beehive-chain {lightspeed wire} {fuse}."
  },
  {
    "name": "hook",
    "description": "Another term for a {bookend}. It is also used for other hook-shaped things, such as occur in the {eater1} and the {hook with tail}, for example."
  },
  {
    "name": "H-to-G",
    "description": "A {Herschel-to-glider} {converter}."
  },
  {
    "name": "hybrid grey ship",
    "description": "A {grey ship} containing more than one type of region of density 1/2, usually a combination of a {with-the-grain grey ship} and an {against-the-grain grey ship}."
  },
  {
    "name": "Immigration",
    "description": "A form of {colourised Life} in which there are two types of ON cell, a newly-born cell taking the type of the majority of its three {parent cells} and surviving cells remaining of the same type as in the previous generation."
  },
  {
    "name": "independent conduit",
    "description": "A {Herschel conduit} in which the input Herschel produces its {first natural glider}. Compare {dependent conduit}."
  },
  {
    "name": "induction coil",
    "description": "Any object used to stabilize an edge (or edges) without touching. The tubs used in the {Gray counter} are examples, as are the blocks and snakes used in the {Hertz oscillator} and the heptomino at the bottom of the {mathematician}."
  },
  {
    "name": "inductor",
    "description": "Any {oscillator} with a row of dead cells down the middle and whose two halves are mirror images of one another, both halves being required for the oscillator to work. The classic examples are the {pulsar} and the {tumbler}. If still lifes are considered as p1 oscillators then there are numerous simple examples that include this kind of central {gutter}, such as {table on table}, {dead spark coil} and {cis-mirrored R-bee}. Some spaceships, such as the {brain}, the {snail} and the {spider}, use the same principle."
  },
  {
    "name": "infinite glider hotel",
    "description": "A pattern by David Bell, named after Hilbert's \"infinite hotel\" scenario in which a hotel with an infinite number of rooms has room for more guests even if it is already full, simply by shuffling the old guests around. In this pattern, two pairs of {Cordership}s moving at c/12 are pulling apart such that there is an ever-lengthening {glider} track between them. Every 128 generations another glider is {inject}ed into the glider track (see {LWSS-glider bounce}), joining the gliders already circulating there. The number of gliders in the track therefore increases without limit. The tricky part of this construction is that even though all the previously injected gliders are repeatedly flying through the injection point, that point is guaranteed to be empty when it is time for the next glider to be injected."
  },
  {
    "name": "inserter",
    "description": "A mechanism that can add another spaceship into a stream or convoy of other spaceships without affecting the existing spaceships. For examples see {Fx119 inserter}, {tee}, {GIG}, {clock insertion} and {inject}."
  },
  {
    "name": "intermediate target",
    "description": "A temporary product of a partial {slow salvo}, {elbow operation}, or {glider synthesis}. An intermediate target is a useful step toward a desired outcome, but will not appear in the final construction."
  },
  {
    "name": "intermittent stream",
    "description": "A {stream} of spaceships which is based on a periodic stream, but which can contain holes where some of the spaceships are not present. There is a base period for the intermittent stream such that if a spaceship arrives at a specific location, then it always does so at a generation which is a multiple of the base period. For example, the output from a period 30 glider gun where every third glider is deleted is an intermittent stream. A {pseudo-random glider generator} can produce a complicated intermittent stream with no obvious pattern. Intermittent streams can be used to transmit {signal}s, where holes in the stream can also convey information. For example, the stream can be processed by an {inverter} having the same period."
  },
  {
    "name": "intermitting glider gun",
    "description": "Despite the name, an intermitting glider gun (IMG) is more often an {oscillator} than a {gun}. There are two basic types. A type 1 IMG consists of two guns firing at one another in such a way that each gun is temporarily disabled on being hit by a glider from the other gun. A type 2 IMG consists of a single gun firing at a 180-degree glider {reflector} in such a way that returning gliders temporarily disable the gun. Both types of IMG can be used to make glider guns of periods that are multiples of the base period. This is done by firing another gun across the two-way {intermittent stream} of gliders in the IMG in such a way that gliders only occasionally escape."
  },
  {
    "name": "inverter",
    "description": "A device which can be used to invert the presence or absence of spaceships in an {intermittent stream} of spaceships. The device must be a gun whose period matches the base period of the stream, since if there are no input spaceships then the device must produce spaceships as the result of the inversion. Typically the spaceships are gliders, and the inverter is made from a glider gun. Inverters provide a way to produce a NOT logic operation on a stream. There are several ways to produce an inverter. The simplest method is to simply hit the output of a gun with the input stream to delete its spaceships, producing an output stream that is always turned 90 degrees from the input stream. An example is the northernmost p30 gun in the {glider duplicator} example pattern. For one way to produce an inverted output stream which is not turned, see {inline inverter}."
  },
  {
    "name": "island",
    "description": "The individual {polyplet}s of which a {stable} pattern consists are sometimes called islands. So, for example, a {boat} has only one island, while an {aircraft carrier} has two, a {honey farm} has four and the standard form of the {eater3} has five."
  },
  {
    "name": "jagged lines",
    "description": "A pattern constructed by Dean Hickerson in May 2005 that uses {puffer}s to produce a line of {bi-block}s that weaves back and forth in a complicated way."
  },
  {
    "name": "Jaws",
    "description": "A {breeder} constructed by Nick Gotts in February 1997. In the original version Jaws had an initial {population} of 150, which at the time was the smallest for any known pattern with {superlinear growth}. In November 1997 Gotts produced a 130-cell Jaws using some {switch engine} {predecessor}s found by Paul Callahan. See {switch-engine ping-pong} for the lowest-population superlinear growth pattern as of July 2018, along with a list of the record-holders. Jaws consists of eight pairs of switch engines which produce a new block-laying switch engine (plus masses of junk) every 10752 generations. It is therefore an MMS breeder."
  },
  {
    "name": "JHC",
    "description": "John Horton Conway. Also another name for {monogram}."
  },
  {
    "name": "kidney",
    "description": "A Gosperism for {century}. See also {diuresis}."
  },
  {
    "name": "Klein bottle",
    "description": "As an alternative to a {torus}, it's possible to make a finite Life universe in the form of a Klein bottle. The simplest way to do this is to use an m x n rectangle with the top edge joined to the bottom edge (as for a torus) and the left edge twisted and joined to the right."
  },
  {
    "name": "knightship",
    "description": "Any {spaceship} of type (2m,m)/n - that is, a spaceship of any speed that moves obliquely in a (2,1) direction. The first Conway's Life knightship was a variant of Andrew Wade's {Gemini} spaceship, constructed in May 2010. The next was an even slower knightship based on the {half-bakery reaction}. A knightship must be asymmetric and its period must be at least 6. This is barely within the range of current {search program}s, as proven by the discovery on March 6, 2018 of an {elementary} knightship, {Sir Robin}, by Adam P. Goucher and Tomas Rokicki. By analogy with the corresponding fairy chess pieces, spaceships of types (3m,m)/n, (3m,2m)/n and (4m,m)/n would presumably be called camelships, zebraships and giraffeships, respectively. Such spaceships do exist (see {universal constructor}) but small elementary versions are even more difficult to search for. Any of these ship types could be constructed by trivially modifying a Gemini spaceship, or less trivially by reprogramming one of the more recent small {Geminoid} {construction arm}s, but as of July 2018 a camelship Gemini is the only example that has been explicitly built. Alternatively, the term \"knightship\" is regularly used to refer to any {oblique} spaceship, such as the original {Gemini} or the {waterbear}."
  },
  {
    "name": "lane",
    "description": "A path traveled by a glider, or less commonly a spaceship such as a loafer. The lane is centered on the line of symmetry (if any) of the spaceship in question. If a lane is clear, then the spaceship can travel along it without colliding or interfering with any other objects. Diagonal lanes are often numbered consecutively, in half-diagonals ({hd}). Occasionally diagonal lane measurements are given in quarter-diagonals ({qd}), in part because diagonally symmetric spaceships have a line of symmetry 1qd away from the lines available for gliders. It's also convenient that moving a glider forward by 100qd (for example) has the same effect as evolving the same glider for 100 ticks."
  },
  {
    "name": "large prime oscillator",
    "description": "Any oscillator with a relatively small {bounding box} whose period is a very large prime. (If the bounding-box restriction is removed, then eight gliders travelling in a four-{Snark} loop would provide a trivial example for any chosen prime.) The first such oscillator was built by Gabriel Nivasch in 2003. The current record holder is an oscillator constructed by Adam P. Goucher with a period that is a Mersenne prime with 13,395 digits (2^44497-1). The next higher Mersenne-prime oscillator, period 2^86243-1, could be constructed with {quadri-Snark}s and {semi-Snark}s. It would actually be significantly smaller than the current record holder. As of June 2018 the construction of this pattern has not yet been completed."
  },
  {
    "name": "Life",
    "description": "A 2-dimensional 2-state {cellular automaton} discovered by John Conway in 1970. The states are referred to as ON and OFF (or live and dead). The transition rule is as follows: a cell that is ON will remain ON in the next generation if and only if exactly 2 or 3 of the 8 adjacent cells are also ON, and a cell that is OFF will turn ON if and only if exactly 3 of the 8 adjacent cells are ON. (This is more succinctly stated as: \"If 2 of your 8 nearest neighbours are ON, don't change. If 3 are ON, turn ON. Otherwise, turn OFF.\")"
  },
  {
    "name": "Life32",
    "description": "A freeware Life program by Johan Bontes for Microsoft Windows 95/98/ME/NT/2000/XP: {https://github.com/JBontes/Life32/}."
  },
  {
    "name": "LifeHistory",
    "description": "A multistate CA rule supported by {Golly}, equivalent to two-state B3/S23 Life but with several additional states intended for annotation purposes. A \"history\" state records whether an off cell has ever turned on in the past, and other states allow on and off cells to be permanently or temporarily marked, without affecting the {evolution} of the pattern."
  },
  {
    "name": "LifeLab",
    "description": "A shareware Life program by Andrew Trevorrow for the Macintosh (MacOS 8.6 or later): {http://www.trevorrow.com/lifelab/}."
  },
  {
    "name": "LifeLine",
    "description": "A newsletter edited by Robert Wainwright from 1971 to 1973. During this period it was the main forum for discussions about Life. The newsletter was nominally quarterly, but the actual dates of its eleven issues were as follows: Mar, Jun, Sep, Dec 1971 Sep, Oct, Nov, Dec 1972 Mar, Jun, Sep 1973"
  },
  {
    "name": "Lifenthusiast",
    "description": "A Life enthusiast. Term coined by Robert Wainwright."
  },
  {
    "name": "lifesrc",
    "description": "David Bell's Life {search program} for finding new {spaceship}s and {oscillator}s. This is a C implementation of an algorithm developed by Dean Hickerson in 6502 assembler. Although lifesrc itself is a command-line program, Jason Summers has made a GUI version called {WinLifeSearch} for Microsoft Windows. A Java version, {JavaLifeSearch}, was written in November 2012 by Karel Suhajda. The lifesrc algorithm is only useful for very small periods, as the amount of computing power required rises rapidly with increasing period. For most purposes, period 7 is the practical limit with current hardware. Lifesrc is available from {http://tip.net.au/~dbell/} (source code only). Compare {gfind}."
  },
  {
    "name": "LifeViewer",
    "description": "A scriptable Javascript Life pattern viewer written by Chris Rowett, used primarily on the conwaylife.com discussion forums."
  },
  {
    "name": "linear growth",
    "description": "A growth rate proportional to T, where T is the number of ticks that a pattern has been run. Compare {superlinear growth}, {quadratic growth}."
  },
  {
    "name": "linear propagator",
    "description": "A self-replicating pattern in which each copy of a pattern produces one child that is an exact copy of itself. The child pattern then blocks the parent from any further replication. An example was constructed by Dave Greene on 23 November 2013, with a construction arm using two glider lanes separated by {9hd}. By some definitions, due to its limited one-dimensional growth pattern, the linear propagator is not a true replicator. Compare {quadratic replicator}."
  },
  {
    "name": "line crosser",
    "description": "A pattern which is able to send a signal across an infinite diagonal line of live cells without destroying the line. David Bell built one in August 2006. It uses many one-shot period 44160 {glider gun}s on both sides of the line having the proper synchronization to create the reactions shown in {line-cutting reaction} and {line-mending reaction}. An input glider can arrive at any multiple of 44160 generations to first cut the line, then send a glider through the gap, and finally mend the line while leaving an output glider on the other side. A line crosser whose complete mechanism is on one side of the line is theoretically possible, using {single-channel} construction methods for example."
  },
  {
    "name": "line puffer",
    "description": "A {puffer} which produces its output by means of an orthogonal line of cells at right angles to the direction of travel. The archetypal line puffer was found by Alan Hensel in March 1994, based on a {spaceship} found earlier that month by Hartmut Holzwart. The following month Holzwart found a way to make {extensible} c/2 line puffers, and Hensel found a much smaller stabilization the following day. But in October 1995 Tim Coe discovered that for large widths these were often unstable, although typically lasting millions of generations. In May 1996, however, Coe found a way to fix the instability. The resulting puffers appear to be completely stable and to exhibit an exponential increase in period as a function of width, although neither of these things has been proved. Line puffers have enabled the construction of various difficult periods for c/2 spaceships and puffers, including occasionally periods which are not multiples of 4 and which would therefore be impossible to attain with the usual type of construction based on {standard spaceship}s. (See {frothing puffer} for another method of constructing such periods.) In particular, the first c/2 {rake} with period not divisible by 4 was achieved in January 2000 when David Bell constructed a p42 {backrake} by means of line puffers. See also {hivenudger} and {puff suppressor}."
  },
  {
    "name": "line ship",
    "description": "A {spaceship} in which the front end is a {linestretcher}, the line being eaten by the back end."
  },
  {
    "name": "linestretcher",
    "description": "A {wickstretcher} that stretches a single diagonal line of cells. The first example was constructed by Jason Summers in March 1999; this was c/12 and used {switch engine} based puffers found earlier by Dean Hickerson. The first c/4 example was found by Hartmut Holzwart in November 2004."
  },
  {
    "name": "logarithmic growth",
    "description": "A pattern whose {population} or {bounding box} grows no faster than logarithmically, asymptotic to n.log(t) for some constant n. The first such pattern constructed was the {caber tosser} whose population is logarithmic, but whose bounding box still grows linearly. The first pattern whose bounding box and population both grow logarithmically was constructed by Jason Summers with Gabriel Nivasch in 2003. For a pattern with a slower growth rate than this, see {Osqrtlogt}."
  },
  {
    "name": "long",
    "description": "A term applied to an object that is of the same basic form as some standard object, but longer. For examples see {long barge}, {long boat}, {long bookend}, {long canoe}, {long shillelagh}, {long ship} and {long snake}."
  },
  {
    "name": "long^3",
    "description": "The next degree of longness after {long long}. Some people prefer \"extra long\"."
  },
  {
    "name": "long^4",
    "description": "The next degree of longness after {long^3}. Some people prefer \"extra extra long\"."
  },
  {
    "name": "long long",
    "description": "The next degree of longness after {long}. Some people prefer \"very long\"."
  },
  {
    "name": "lossless elbow",
    "description": "A stationary {elbow} in a {construction arm} {toolkit} that allows a {recipe} to turn a corner with no exponential increase in construction cost. Compare {slow elbow}. It is theoretically possible to construct lossless elbows for early construction arms such as the one in the {10hd Demonoid}, but these would currently have to be very large. The lossless elbow that has been used the most in practice is the {Snark}, which can be constructed directly on a {single-channel} {construction lane} using a {Snarkmaker} {recipe}. Controlled demolition of a Snark is also possible, to remove a temporary elbow that is no longer needed, and leave a {hand} target in its place if necessary for further construction. A {Silver reflector} was used as a lossless elbow in the first {spiral growth} pattern, attached to a separate {universal constructor} component."
  },
  {
    "name": "lumps of muck",
    "description": "The common evolutionary sequence that ends in the {blockade}. The name is sometimes used of the blockade itself, and can in general be used of any stage of the evolution of the {stairstep hexomino}."
  },
  {
    "name": "LWTDS",
    "description": "Life Worker Time Deficiency Syndrome. Term coined by Dieter Leithner to describe the problem of having to divide scarce time between Life and real life."
  },
  {
    "name": "macrocell",
    "description": "A format used by {Golly} and its {hashlife} algorithm, capable of storing repetitive patterns very efficiently, even if they contain a large number of cells. For example, a filled square 2^167 cells on a side can be stored in less than three kilobytes in macrocell format, or about 800 bytes in compressed macrocell format. The square's total population is over a googol, 10^100; the number of atoms in the observable universe is only about 10^80. This high level of compression is obtained by defining a tree structure composed of increasingly large cell \"tiles\" with power-of-two dimensions. Tile definitions of any size are re-used whenever they appear multiple times in a large pattern (at the same power-of-two offset). For example, the following is a macrocell encoding of a complex {pseudo still life} arrangement of {ship}s, with a total population over 2500 cells: [M2] (golly 3.0) #R B3/S23 .**.**$*.*.*.*$**...**$$**...**$*.*.*.*$.**.**$ 4 0 1 1 1 5 2 0 2 2 6 3 3 0 3 7 4 4 4 4 The first line after the #R rule line defines a quadtree tile at the lowest level - a level-3 tile in this case, meaning a 2^3 square area. At this level the pattern is encoded in a modified ASCII format with dollar signs as line separators. The next line, #2, defines a level-4 quadtree tile, made from one empty level-3 tile in the northwest corner (0), and three copies of the level-3 tile that was defined on the previous line (1). Lines 3, 4, and 5 similarly define level 5, 6, and 7 quadtree tiles by giving the line numbers of four tiles of the next lower size. Many patterns are only moderately repetitive, so macrocell format is somewhat less successful at compressing them. Certainly most patterns are not nearly as regular as the artificial example above: there are usually many different tiles defined at each level, not just one. Chaotic patterns, such as {ash} from random {soup}s, usually need so many different tile definitions that they can be stored more efficiently using {rle} format."
  },
  {
    "name": "macro-spaceship",
    "description": "A {self-constructing} or {self-supporting} {spaceship}, such as the {Caterpillar}, {Centipede}, {half-baked knightship}, {waterbear}, {Demonoid}, {Orthogonoid}, and {Caterloopillar}. Engineered spaceships of these types tend to be much larger and more complex than {elementary} spaceships."
  },
  {
    "name": "Max",
    "description": "A name for the smallest known {spacefiller}. The name represents the fact that the growth rate is the fastest possible. (This has not quite been proved, however. There remains the possibility, albeit not very likely, that a periodic {agar} could have an average {density} greater than 1/2, and a spacefiller stretching such an agar at the same speed as the known spacefillers would have a faster average growth rate.)"
  },
  {
    "name": "metacatacryst",
    "description": "A 52-cell pattern exhibiting quadratic growth. Found by Nick Gotts, December 2000. This was for some time the smallest known pattern (in terms of initial population) with superlinear growth. See {switch-engine ping-pong} for the lowest-population {superlinear growth} pattern as of July 2018, along with a list of the record-holders."
  },
  {
    "name": "metacell",
    "description": "CA logic circuitry that emulates the behavior of a single cell. The circuitry is hard-wired to emulate a particular CA rule, but changing the rule is usually a matter of making simple adjustments. Known examples include David Bell's original 500x500 {unit Life cell}, Jared Prince's {Deep Cell}, Brice Due's {OTCA metapixel}, and Adam P. Goucher's {megacell}."
  },
  {
    "name": "methuselah",
    "description": "Any small pattern that stabilizes only after a long time. Term coined by Conway. Examples include {rabbits}, {acorn}, the {R-pentomino}, {blom}, {Iwona}, {Justyna} and {Lidka}. See also {ark}."
  },
  {
    "name": "M.I.P. value",
    "description": "The maximum {population} divided by the initial population for an unstable pattern. For example, the {R-pentomino} has an M.I.P. value of 63.8, since its maximum population is 319. The term is no longer in use."
  },
  {
    "name": "mod",
    "description": "The smallest number of generations it takes for an {oscillator} or {spaceship} to reappear in its original form, possibly subject to some rotation or reflection. The mod may be equal to the {period}, but it may also be a quarter of the period (for oscillators that rotate 90 degrees every quarter period) or half the period (for other oscillators which rotate 180 degrees every half period, and also for {flipper}s)."
  },
  {
    "name": "monochromatic salvo",
    "description": "A {slow salvo} that uses gliders of only one colour. For example, the slow salvos generated by {half-baked knightship}s are monochromatic, because they are generated by a single type of reaction which can happen at any position along a diagonal line. The smallest possible step size is one {full diagonal} (1fd), which is two {half diagonal}s (2hd), which means that any single glider-producing reaction can only reach half of the available glider {lane}s. See {colour of a glider}."
  },
  {
    "name": "monoparity salvo",
    "description": "A {slow salvo} that uses gliders of only one {parity}. Compare {monochromatic salvo}."
  },
  {
    "name": "Moore neighbourhood",
    "description": "The set of all cells that are orthogonally or diagonally adjacent to a cell or group of cells. The Moore neighbourhood of a cell can be thought of as the points at a Chebyshev distance of 1 from that cell. Compare {von Neumann neighbourhood}. The Conway's Life rule is based on the Moore neighborhood, as are all the \"Life-like\" rules and many other commonly investigated rule families. Cell neighbourhoods can also be defined with a higher range. The Moore neighbourhood of range n can be defined recursively as the Moore neighbourhood of the Moore neighbourhood of range n-1. For example, the Moore neighbourhood of range 2 includes all cells that are orthogonally or diagonally adjacent to the standard Moore neighbourhood."
  },
  {
    "name": "mosquito1",
    "description": "A {breeder} constructed by Nick Gotts in September 1998. The original version had an initial population of 103, which was then the smallest for any known pattern with superlinear growth (beating the record previously held by {Jaws}). This was reduced to 97 by Stephen Silver the following month, but was then almost immediately superseded by {mosquito2}. Mosquito1 consists of the classic {puffer train} plus four {LWSS} and four {MWSS} (mostly in {predecessor} form, to keep the population down). Once it gets going it produces a new block-laying {switch engine} (plus a lot of junk) every 280 generations. It is therefore an MMS breeder, albeit a messy one."
  },
  {
    "name": "mosquito2",
    "description": "A {breeder} constructed by Nick Gotts in October 1998. Its initial population of 85 was for a couple of hours the smallest for any known pattern with superlinear growth, but was then beaten by {mosquito3}. Mosquito2 is very like {mosquito1}, but uses two fewer {MWSS} and one more {LWSS}."
  },
  {
    "name": "mosquito3",
    "description": "A {breeder} constructed by Nick Gotts in October 1998. Its initial population of 75 was at the time the smallest for any known pattern with superlinear growth, but was beaten a few days later by {mosquito4}. Mosquito3 has one less {LWSS} than {mosquito2}. It is somewhat different from the earlier mosquitoes in that the {switch engine}s it makes are glider-producing rather than block-laying."
  },
  {
    "name": "mosquito4",
    "description": "A slightly improved version of {mosquito3} which Stephen Silver produced in October 1998 making use of another discovery of Nick Gotts (September 1997): an 8-cell pattern that evolves into a {LWSS} plus some junk. Mosquito4 is a {breeder} with an initial population of 73, at the time the smallest for any known pattern with superlinear growth, but superseded a few days later by {mosquito5}."
  },
  {
    "name": "mosquito5",
    "description": "A slightly improved version of {mosquito4} which Nick Gotts produced in October 1998. The improvement is of a similar nature to the improvement of mosquito4 over mosquito3. Mosquito5 is a {breeder} with an initial population of 71. This was the smallest population for any known pattern with superlinear growth until it was superseded by {teeth}. See {switch-engine ping-pong} for the smallest such pattern as of July 2018, along with a list of the record-holders."
  },
  {
    "name": "moving sawtooth",
    "description": "A {sawtooth} such that no cell is ON for more than a finite number generations. David Bell constructed the first pattern of this type, with a c/2 front end and a c/3 back end. The front end is a {blinker puffer}. The back end ignites the {blinker fuse}. The smallest currently known moving sawtooth was constructed in April 2011 by a conwaylife.com forum user with the handle 'cloudy197'. The c/2 front end is a {bi-block puffer}. The 2c/5 back end ignites the {bi-block fuse}."
  },
  {
    "name": "multiplicity",
    "description": "In a {reflectorless rotating oscillator}, the maximum number n of independent patterns that can orbit a single point, in a way that reduces the period of the combined oscillator by a factor of n."
  },
  {
    "name": "My Experience with B-heptominos in Oscillators",
    "description": "An article by Dave Buckingham (October 1996) available from {http://conwaylife.com/ref/lifepage/patterns/bhept/bhept.html}. It describes his discovery of {Herschel conduit}s, including sufficient (indeed ample) {stable} conduits to enable, for the first time, the construction of period n oscillators and {true} period n guns for every sufficiently large integer n. See {Herschel loop} and {emu}."
  },
  {
    "name": "natural",
    "description": "Occurring often in random patterns. There is no precise measure of naturalness, since the most useful definition of \"random\" in this context is open to debate. Nonetheless, it is clear that objects such as {block}s, {blinker}s, {beehive}s and {glider}s are very natural, while {eater2}s, {dart}s, {gun}s, etc., are not."
  },
  {
    "name": "neighbour",
    "description": "Any of the eight cells adjacent to a given cell. A cell is therefore not considered to be a neighbour of itself, although the neighbourhood used in Life does in fact include this cell (see {cellular automaton})."
  },
  {
    "name": "n-omino",
    "description": "Any {polyomino} with exactly n cells."
  },
  {
    "name": "non-destructive read",
    "description": "A type of test reaction in {memory cell} circuitry, where the information in the memory cell is unchanged and can be read again to produce the same result. One simple type of non-destructive read reaction is a {signal} sent to a {permanent switch}. Memory cells with {destructive read} reactions are generally simpler and more commonly used."
  },
  {
    "name": "non-spark",
    "description": "Something that looks like a spark, but isn't. An {OWSS} produces one of these instead of a {belly spark}, and is destroyed by it."
  },
  {
    "name": "non-standard spaceship",
    "description": "Any {spaceship} other than a {glider}, {LWSS}, {MWSS} or {HWSS}."
  },
  {
    "name": "non-trivial",
    "description": "A non-trivial period-N {oscillator} contains at least one cell that oscillates at the full period. In other words, it is not made up solely of separate oscillators with smaller periods. Usually it includes a {spark} or other reaction that would not occur if all lower-period subpatterns were separated from each other, but some exceptions are given under {trivial}. See also {omniperiodic}."
  },
  {
    "name": "novelty generator",
    "description": "A pattern that appears to have an {unknown fate} due to complex feedback loops, for example involving {wave}s of gliders shuttling between perpendicular {rake}s. Novelty generator patterns fall short of counting as {chaotic growth}, since the rakes continue to be predictable, and much of their {ash} generally remains stable. It has not been proven conclusively that any particular pattern is in fact an infinite novelty generator, since it is always possible that periodicity will spontaneously arise if the simulation is continued far enough. In fact this happens quite regularly. But conversely, it has not been proven that periodicity must spontaneously arise for all such patterns. Bill Gosper, Nick Gotts and others have done extensive experiments along these lines using {Golly}."
  },
  {
    "name": "oblique",
    "description": "Neither diagonal nor orthogonal. See also {knightship}."
  },
  {
    "name": "obo spark",
    "description": "A {spark} of the form O.O (so called after its {rle} encoding)."
  },
  {
    "name": "omniperiodic",
    "description": "A {cellular automaton} is said to be omniperiodic if it has {oscillator}s of all {period}s. It is not known if Life is omniperiodic, although this seems likely. Dave Buckingham's work on Herschel conduits in 1996 (see {My Experience with B-heptominos in Oscillators}) left only a short list of unresolved cases, all with periods of 58 or below. The list has been progressively reduced since then. Most recently, period 43 and 53 oscillators were made possible in 2013 by Mike Playle's {Snark}. As of June 2018, no oscillators are known for periods 19, 23, 38, or 41. If we insist that the oscillator must be {non-trivial}, then 34 should be added to this list. Note that if we were to allow infinite oscillators, then all periods are certainly possible, as any period of 14 or more can be obtained using a {glider} (or {LWSS}) stream, or an infinitely long {2c/3} wire containing signals with the desired separation."
  },
  {
    "name": "one-time",
    "description": "A term used for {turner}s and {splitter}s, specifying that the reaction in question is not repeatable as it would be in a {reflector} or {fanout} device. Instead, the {constellation} is used up, usually in a {clean} reaction, but the much more common {dirty} turners and splitters are also very useful in some situations."
  },
  {
    "name": "on-off",
    "description": "Any p2 {oscillator} in which all {rotor} cells die from {overpopulation}. The simplest example is a {beacon}. Compare {flip-flop}."
  },
  {
    "name": "orbit",
    "description": "A term proposed by Jason Summers to refer to a natural stabilization of a {puffer}. For example, the {switch engine} has two (known) orbits, the block-laying one and the glider-producing one."
  },
  {
    "name": "orphan",
    "description": "Conway's preferred term for a {Garden of Eden}. According to some definitions, an orphan consists of just the minimum living and dead cells needed to ensure that no parent is possible, whereas a GoE is an entire infinite Life plane that contains an orphan."
  },
  {
    "name": "Orthogonoid",
    "description": "A {self-constructing} {spaceship} analogous to the {Demonoid}s, with a slow orthogonal direction of travel. The first example was completed by Dave Greene on 29 June 2017, with a top speed of 16c/217251 (this is just 256c/3476016 in lowest terms). The construction recipe is a stream of MWSSes, with the recovery time limited to 90 ticks by the {Lx200} {dependent conduit} that follows the initial {syringe} converter. The design is {hashlife}-friendly, meaning that the spaceship can be trivially adjusted so that spatial and temporal offsets are exact powers of two; period 4194304 and period 8388608 versions have been constructed, with speeds of c/16384 and c/32768 respectively. The MWSSes are converted to {Herschel}s, which produce a standard {single-channel} glider stream that runs the Orthogonoid's single construction arm. After the child circuitry is complete, a previously constructed {Snark} in the parent is removed from the construction arm lane, converting it to a \"destruction arm\" that shoots down the previous constructor/reflector in the series."
  },
  {
    "name": "oscillator",
    "description": "Any pattern that is a {predecessor} of itself. The term is usually restricted to non-{stable} finite patterns; period 1 oscillators are {stable} and are usually just called {still life}s. The {blinker} is the smallest non-stable oscillator, having period 2. There are oscillators of almost all higher periods (see {omniperiodic}). In general {cellular automaton} theory the term \"oscillator\" usually covers {spaceship}s as well, but this usage is not normal in Life. Oscillators consisting of separate objects which do not react in any phase are usually ignored. For example, a separated {blinker} and {pulsar} makes a period 6 oscillator, but is considered {trivial}. An oscillator can be divided into a {rotor} and a {stator}, and the stator can be further subdivided into {bushing} and {casing}. Some oscillators have no casing cells, and a few 100%-{volatility} oscillators also have no bushing cells. An oscillator can be constructed from any {gun} as long as {eater}s can be added to consume its output. If it is a {true} {gun} then the period of the oscillator will be the same as the gun - unless the eating mechanism multiplies the period, as in the case of gliders caught by a {boat-bit}. With the discovery of {reflector}s, {relay}s provide an easy way to create oscillators of all large periods. For example, eight gliders travelling in a loop created by four {Snark}s can create any period above 42, with a population never exceeding 356 live cells. For the very lowest periods, whole families of {extensible} oscillators are known. Examples of this are {barberpole}, {cross}, {pentoad}, {p6 shuttle}, {snacker}, and {multiple roteightors}. Any of the {shuttle}s are oscillators by definition, for example the {queen bee shuttle}. Many of these are also extensible. Other oscillators such as {figure-8} and {tumbler} have unique mechanisms that are not part of an extended family. Some oscillators are useful because of the {perturbation}s they can cause to other objects. This is especially true if they provide a {spark} on their boundary. Some oscillators are explicitly found by {search program}s in order to produce these sparks, such as {pipsquirter}s. Some higher period oscillators have been found while running random {soup}s. This is especially true if the soup is run on a cylindrical or torus {universe}. Sometimes the found objects can be moved to the normal universe and supported there by added {catalyst}s. {Achim's p144} is an example."
  },
  {
    "name": "Osqrtlogt",
    "description": "A pattern constructed by Adam P. Goucher in 2010, which uses an unbounded triangular region as memory for a binary counter. Empty space is read as a zero, and a boat as a one, as shown in the example pattern in {memory cell}. The pattern's diametric growth rate is O(sqrt(log(t))), which is the slowest possible for any Life pattern, or indeed any 2D Euclidean cellular automaton. The population returns infinitely often to its initial minimum value (during carry operations from 11111...1 to 100000...0, so it can be considered to be an unusual form of {sawtooth}."
  },
  {
    "name": "OTCA metapixel",
    "description": "A 2048 x 2048 period 35328 {metacell} constructed by Brice Due in 2006. It contains a large \"pixel\" area that contains a large population of {LWSS}es when the metacell state is ON, but is empty when it is OFF. This allows the state of the metacell to be visible at high zoom levels, unlike previous {unit cell}s where the state was signaled by the presence or absence of a single glider in a specific location."
  },
  {
    "name": "overclocking",
    "description": "A term used when a {circuit} can accept a signal at a specific period which it cannot accept at a higher period. A {syringe} is a simple example. Some {staged recovery} circuits also permit overclocking, and can function successfully at a rate faster than their {recovery time}. A {Silver reflector} has a recovery time of 497 ticks, but can be overclocked to reflect a period 250 glider stream, or any nearby period above 248, simply by removing a beehive after the first glider enters the reflector. However, a continuous stream of gliders is then required to maintain the circuit, with timing within a tightly bounded range."
  },
  {
    "name": "overpopulation",
    "description": "Death of a cell caused by it having more than three {neighbour}s. See also {underpopulation}."
  },
  {
    "name": "over-unity reaction",
    "description": "An important concept in {gun} and {macro-spaceship} construction. To be a good candidate for building one of these types of patterns with a new period or speed, a stationary reaction (for a gun) or a moving reaction (for a macro-spaceship) must be able to produce some number of output {signal}s, strictly greater than the number of input signals required to maintain the reaction. The extra signal becomes a gun's output {stream}, or may be used in a variety of ways to construct the supporting {track} for a macro-spaceship. By implication, \"over-unity\" refers to the ratio of output signals to input signals. If all signal outputs must be used up to sustain a stationary reaction, a high-period {oscillator} may still be possible. See {emu} for example."
  },
  {
    "name": "OWSS",
    "description": "A would-be {spaceship} similar to {LWSS}, {MWSS} and {HWSS} but longer. On its own an OWSS is unstable, but it can be escorted by true spaceships to form a {flotilla}."
  },
  {
    "name": "Ox",
    "description": "A 1976 novel by Piers Anthony which involves Life."
  },
  {
    "name": "p1",
    "description": "Period 1, i.e., {stable}. In the context of logic {circuit}ry, this tends to mean that a mechanism is constructed from {Herschel conduit}s that contain only {still life}s as {catalyst}s. In the context of {slow glider construction}, a P1 {slow salvo} is one in which there are no constraints on the {parity} of gliders in the salvo, because the {intermediate target}s are all stable constellations. (The usual alternative is a \"P2 slow salvo\", where the relative timing between adjacent gliders can be increased arbitrarily, but only by multiples of two ticks.)"
  },
  {
    "name": "p144 gun",
    "description": "A {glider gun} with {true} period 144. The first one was found by Bill Gosper in July 1994. For a full description and pattern see {factory}."
  },
  {
    "name": "p14 gun",
    "description": "A glider gun which emits a period 14 glider stream. This is the smallest possible period for any stream, so such a gun is of great interest. There is no known true-period p14 glider gun, and finding a small direct example is well beyond current search algorithms' abilities. However, pseudo-period p14 guns have been created by {inject}ing gliders into a higher period glider stream. The first pseudo p14 gun was built by Dieter Leithner in 1995. Smaller pseudo p14 guns have since been constructed, but they are still much too large to show here. The essential mechanism used by them is demonstrated in {GIG}."
  },
  {
    "name": "p15 reflector",
    "description": "An ambiguous term that may refer to {PD-pair reflector}, {p15 bouncer}, or the more recently discovered {p15 bumper}."
  },
  {
    "name": "p1 megacell",
    "description": "A {metacell} constructed by Adam P. Goucher in 2008, capable of being programmed to emulate any Moore neighborhood rule, including isotropic and anisotropic non-totalistic rules. It fits in a 32768 by 32768 bounding box, with the resulting metacell grid at 45 degrees to the underlying Life grid. Like the {OTCA metapixel}, it includes a large \"pixel\" area so that the state of the megacell can easily be seen even at extremely small-scale zoom levels."
  },
  {
    "name": "p1 telegraph",
    "description": "A variant of Jason Summers' {telegraph} pattern, constructed in 2010 by Adam P. Goucher using only stable circuitry. A single incoming glider produces the entire ten-part composite lightspeed signal that restores the beehive-chain {lightspeed wire} to its original position. The signal is detected at the other end of the telegraph and converted back into a single output signal. This simplification came at the cost of a much slower transmission speed, one bit per 91080 ticks. In this mechanism, sending the entire ten-part signal constitutes a '1' bit, and not sending the signal means '0'. See also {high-bandwidth telegraph}."
  },
  {
    "name": "p5 reflector",
    "description": "Traditional name for {p5 bouncer} before 2016, but with the discovery of the {p5 bumper} this has become an ambiguous reference."
  },
  {
    "name": "p6 reflector",
    "description": "Traditional name for {p6 bouncer} before 2016, but with the discovery of the {p6 bumper} this has become an ambiguous reference."
  },
  {
    "name": "p7 reflector",
    "description": "Traditional name for {p7 bouncer} before 2016, but with the discovery of the {p7 bumper} this has become an ambiguous reference."
  },
  {
    "name": "p8 reflector",
    "description": "Traditional name for {p8 bouncer} before 2016, but with the discovery of the {p8 bumper} this has become an ambiguous reference."
  },
  {
    "name": "Parallel HBK",
    "description": "c/245912, p245912) A much smaller successor to the {half-baked knightship}, constructed by Chris Cain in September 2014. Several slow-salvo recipes are needed to support the multi-glider salvo {seed}s at the upstream end of the spaceship. \"Parallel\" means that these recipes are sent in parallel instead of one after the other, in series, as in the original HBK."
  },
  {
    "name": "Parallel HBK gun",
    "description": "An {armless} constructor pattern that is programmed to build {Parallel HBK} oblique spaceships every 125906944 ticks. This gun was created by Chris Cain on 3 January 2015."
  },
  {
    "name": "parent",
    "description": "A pattern is said to be a parent of the pattern it gives rise to after one generation. Some patterns have infinitely many parents, but others have none at all (see {Garden of Eden}). Typically parents are considered trivial if they contain groups of cells that can be removed without changing the result, such as isolated faraway cells."
  },
  {
    "name": "parent cells",
    "description": "The three cells that cause a new cell to be born."
  },
  {
    "name": "parity",
    "description": "Even or odd, particularly as applied to the {phase} of an oscillator or spaceship. For example, in {slow salvo} constructions, the {intermediate target}s are frequently period 2, most often because they contain {blinker}s or {traffic light}s. A glider striking a P2 constellation will generally produce a different result depending on its parity. Period-4 intermediate targets are rare (or not used), so it doesn't matter for example whether an odd-parity glider in a slow salvo is phase 1 or phase 3. Only the even/odd parity is important."
  },
  {
    "name": "pentaplet",
    "description": "Any 5-cell {polyplet}."
  },
  {
    "name": "pentomino",
    "description": "Any 5-cell {polyomino}. There are 12 such patterns, and Conway assigned them all letters in the range O to Z, loosely based on their shapes. Only in the case of the {R-pentomino} has Conway's label remained in common use, but all of them can nonetheless be found in this lexicon."
  },
  {
    "name": "period",
    "description": "The smallest number of generations it takes for an {oscillator} or {spaceship} to reappear in its original form. The term can also be used for a {puffer}, {wick}, {fuse}, {superstring}, stream of {spaceship}s, {factory} or {gun}. In the last case there is a distinction between {true} period and {pseudo} period. There is also a somewhat different concept of period for {wicktrailer}s."
  },
  {
    "name": "periodic",
    "description": "For {circuit} mechanisms, \"periodic\" is the opposite of {p1} or {stable}. Periodic {circuit}s necessarily contain {oscillator}s, and therefore they can generally only accept input {signal}s that are {synchronized} to the combined {period} of those oscillators (but see {universal regulator}). For {signal} {stream}s, \"periodic\" means that signals will only be present in the stream at one out of every n ticks, where n is the {period} of the stream. In a periodic {intermittent stream} there may be gaps, so that signals do not always appear at every nth tick. However, if a signal does appear, its distance measured in ticks from previous and future signals will always be an exact multiple of n."
  },
  {
    "name": "perturb",
    "description": "To change the fate of an object by reacting it with other objects. Typically, the other objects are sparks from {spaceship}s or {oscillator}s, or are {eater}s or impacting spaceships. Perturbations are typically done to turn a {dirty} reaction into a {clean} one, or to change the products of a reaction. In many desirable cases the perturbing objects are not destroyed by the reaction, or else are easily replenished."
  },
  {
    "name": "phase",
    "description": "A representative generation of a periodic object such as an {oscillator} or {spaceship}. The number of phases is equal to the {period} of the object. The phases of an object usually repeat in the same cyclic sequence forever, although some {perturbation}s can cause a {phase change}."
  },
  {
    "name": "Pianola breeder",
    "description": "A series of patterns by Paul Tooke in 2010, based on a simplification and extension of the {Gemini} spaceship's construction mechanism. Tooke produced a number of slow-salvo-constructed patterns with {superlinear growth}, including a series of breeder patterns of previously unknown types. For some patterns, the Gemini's two {construction arm}s were moved to a permanent stationary platform, using fourteen glider-loop channels instead of twelve. Some of these breeder patterns remain difficult to classify unambiguously. For example, one pattern was designed to be an MSS breeder - a modified {Gemini} spaceship puffing {slide gun}s which build lines of {block}s. However, the slide guns produce both moving and stationary objects at a linear rate, because streams of gliders are needed to reach out to the construction zone to do the {push} reaction and build more blocks. The pattern could therefore be classified as a hybrid MSM/MSS breeder. Other breeder patterns utilizing slide guns and {universal constructor} technology are likely to cause similar classification ambiguities."
  },
  {
    "name": "pi calculator",
    "description": "A device constructed by Adam P. Goucher in February 2010, which calculates the decimal digits of pi (the the Life universe as 8x10 dot matrix characters formed by arrangements of blocks along a diagonal stripe at the top. A {push} reaction moves a ten-block diagonal cursor to the next position as part of the \"printing\" operation for each new digit. The actual calculation is done in binary, using a streaming spigot algorithm based on linear fractional transformations. The pi calculator is made up of a 188-state computer connected to a printing device via period-8 {regulator}s and a binary-to-decimal conversion mechanism. The complete pattern can be found in {Golly}'s Very Large Patterns online archive, along with the very similar 177-state phi calculator which uses a simpler algorithm to calculate and print the Golden Ratio."
  },
  {
    "name": "pipsquirter",
    "description": "An {oscillator} that produces a {domino} {spark} that is orientated parallel to the direction from which it is produced (in contrast to domino sparkers like the {pentadecathlon} and {HWSS}, which produce domino sparks perpendicular to the direction of production). See {p6 pipsquirter}, {p7 pipsquirter}."
  },
  {
    "name": "polyomino",
    "description": "A finite collection of orthogonally connected cells. The mathematical study of polyominoes was initiated by Solomon Golomb in 1953. Conway's early investigations of Life and other cellular automata involved tracking the histories of small polyominoes, this being a reasonable way to ascertain the typical behaviour of different cellular automata when the patterns had to be evolved by hand rather than by computer. Polyominoes have no special significance in Life, but their extensive study during the early years lead to a number of important discoveries and has influenced the terminology of Life. (Note on spelling: As with \"dominoes\" the plural may also be spelt without an e. In this lexicon I have followed Golomb in using the longer form.) It is possible for a polyomino to be an {oscillator}. In fact there are infinitely many examples of such polyominoes, namely the {cross} and its larger analogues. The only other known examples are the {block}, the {blinker}, the {toad}, the {star} and (in two different phases) the {pentadecathlon}. A polyomino can also be a {spaceship}, as the {LWSS}, {MWSS} and {HWSS} show."
  },
  {
    "name": "polyplet",
    "description": "A finite collection of orthogonally or diagonally connected cells. This king-wise connectivity is a more natural concept in Life than the orthogonal connectivity of the {polyomino}."
  },
  {
    "name": "population",
    "description": "The number of ON cells."
  },
  {
    "name": "predecessor",
    "description": "Any pattern that evolves into a given pattern after one or more generations."
  },
  {
    "name": "primer",
    "description": "A pattern originally constructed by Dean Hickerson in November 1991 that emits a stream of {LWSS}s representing the prime numbers. Some improvements were found by Jason Summers in October 2005."
  },
  {
    "name": "pseudo-random glider generator",
    "description": "A {pseudo-random number generator} in which the bits are represented by the presence or absence of {glider}s. The first pseudo-random glider generator was built by Bill Gosper. David Bell built the first moving one in 1997, using c/3 {rake}s."
  },
  {
    "name": "pseudo-random number generator",
    "description": "A pseudo-random number generator (PRNG) is an algorithm that produces a sequence of bits that looks random (but cannot really be random, being algorithmically determined). In Life, the term refers to a PRNG implemented as a Life pattern, with the bits represented by the presence or absence of objects such as {glider}s or {block}s. Such a PRNG usually contains gliders or other {spaceship}s in a loop with a feedback mechanism that causes later spaceships to interfere with the generation of earlier spaceships. The {period} can be very high, as a loop of n spaceships has 2^n possible states."
  },
  {
    "name": "pseudo still life",
    "description": "A {stable} pattern whose live cells are either immediately adjacent to each other, or are connected into a single group by adjacent dead cells where birth is suppressed by overpopulation. The definition of {strict still life} rules out such stable patterns as the {bi-block}. In such patterns there are dead cells which have more than 3 neighbours in total, but fewer than 3 in any component still life. These patterns are called pseudo still lifes, and have been enumerated up to 32 bits, as shown in the table below. -------------- Bits Number -------------- 8 1 9 1 10 7 11 16 12 55 13 110 14 279 15 620 16 1645 17 4067 18 10843 19 27250 20 70637 21 179011 22 462086 23 1184882 24 3068984 25 7906676 26 20463274 27 52816265 28 136655095 29 353198379 30 914075620 31 2364815358 32 6123084116 -------------- Attribution of these counts is given in {strict still life}; see also {https://oeis.org/A056613}. The unique 32-bit {triple pseudo} still life is included in the last count in the table. As the number of bits increases, the pseudo still life count goes up exponentially by approximately O(2.56^n). By comparison, the rate for {strict still life}s is about O(2.46^n) while for {quasi still life}s it's around O(3.04^n). If a stable pattern's live cells plus its overpopulated dead cells do not form a single mutually adjacent group, the pattern is usually referred to as a {constellation}. It is also a {still life} in the general sense, but is neither \"pseudo\" nor \"strict\"."
  },
  {
    "name": "puffer engine",
    "description": "A pattern which can be used as the main component of a {puffer}. The pattern may itself be a puffer (e.g. the classic {puffer train}), it may be a spaceship (e.g. the {Schick engine}), or it may even be unstable (e.g. the {switch engine})."
  },
  {
    "name": "pull",
    "description": "A reaction, most often mediated by gliders, that moves an object closer to the source of the reaction. See {block pull}, {blinker pull}, {loaf pull}; also {elbow}."
  },
  {
    "name": "Pulsar Pixel Display",
    "description": "A large-scale raster line display device constructed by Mark Walsh in August 2010, where {pulsar}s form the individual pixels in an otherwise empty grid. The published sample pattern displays and erases eight 7x5-pixel characters on each of two lines of text."
  },
  {
    "name": "pulse",
    "description": "A moving object, such as a {spaceship} or {Herschel}, which can be used to transmit information. See {pulse divider}. Also another name for a {pulsar quadrant}."
  },
  {
    "name": "push",
    "description": "A reaction that moves an object farther away from the source of the reaction. See {sliding block memory}, {pi calculator}, {elbow}, {universal constructor}. See also {pull}, {fire}."
  },
  {
    "name": "pyrotechneczum",
    "description": "A common mistaken spelling of {pyrotechnecium}, caused by a copying error in the early 1990s."
  },
  {
    "name": "qd",
    "description": "Abbreviation for {quarter diagonal}."
  },
  {
    "name": "QuadLife",
    "description": "A form of {colourised Life} in which there are four types of ON cell. A newly-born cell takes the type of the majority of its three {parent cells}, or the remaining type if its parent cells are all of different types. In areas where there are only two types of ON cell QuadLife reduces to {Immigration}."
  },
  {
    "name": "quadratic filter",
    "description": "A {toolkit} developed by Dean Hickerson and Gabriel Nivasch in 2006, enabling the construction of patterns with asymptotic population growth matching an infinite number of different sublinear functions - namely, O(t^(1/2^n)) for any chosen n. See also {exponential filter}, {recursive filter}."
  },
  {
    "name": "quadratic growth",
    "description": "The fastest possible asymptotic rate of population growth for any Life pattern - O(t^2) in big-O notation, where t is the number of ticks. The first quadratic-growth pattern found was Bill Gosper's 1971 {breeder}. Many other types of breeders and {spacefiller}s have been constructed since. In April 2011, Stephen Silver gave an example of a one-cell-thick pattern over a million cells long that exhibited quadratic growth. In October 2015, Chris Cain constructed a one-cell-thick pattern with a reduced bounding box of 2596x1, improving on a series of previous longer results. The smallest known quadratic growth pattern by initial population is the 23-cell {switch-engine ping-pong} by Michael Simkin. There are an infinite number of possible growth rates between linear and quadratic growth. See {superlinear growth}."
  },
  {
    "name": "quadratic replicator",
    "description": "A pattern that fills all or part of the Life plane by making copies of itself in a nonlinear way. Small quadratic replicators are known in other Life-like rules, but as of July 2018 no example has been found or constructed in Conway's Life."
  },
  {
    "name": "quadratic sawtooth",
    "description": "Any {sawtooth} pattern with a quadratic envelope, or specifically a pattern assembled by Martin Grant in May 2015, consisting of two {caber tosser}s with period multipliers for timing which activate and deactivate two toggleable rake guns (see {toggleable gun}). The gliders emitted by those rakes annihilate on the diagonal while the rakes are eaten by 2c/5 ships. All the rakes and gliders are destroyed before the next cycle. See also {Osqrtlogt}."
  },
  {
    "name": "quarter diagonal",
    "description": "A unit of measurement sometimes used for diagonal distances, especially for {slow salvo} glider {lane}s. One advantage of measurement in quarter diagonals is that gliders travel diagonally at 1qd/tick, so that the same integer value can serve as either a time or a diagonal distance measurement."
  },
  {
    "name": "quasi still life",
    "description": "A {stable} {constellation} where the individual {still life}s share dead cells, so the neighborhoods of those dead cells are changed, but all cells that used to remain dead from under-population still do so. Under Life rules, this occurs when objects are diagonally adjacent (e.g., two {block}s sharing a single diagonal neighbor) or when single protruding cells in two objects such as {tub}s share multiple neighbors. The term is due to Mark Niemiec. ---------------- Bits Count ---------------- 8 6 9 13 10 57 11 141 12 465 13 1224 14 3956 15 11599 16 36538 17 107415 18 327250 19 972040 20 2957488 21 8879327 22 26943317 ---------------- As the number of bits increases, the quasi still life count goes up exponentially by approximately O(3.04^n), slightly more than a factor of three. By comparison, the rate for {strict still life}s is about O(2.46^n) while for {pseudo still life}s it's around O(2.56^n)."
  },
  {
    "name": "Quetzal",
    "description": "Any Herschel track-based gun with a period below 62, which is the lowest period with a stable glider-emitting conduit. This was Dieter Leithner's name for the {true} p54 glider gun he built in January 1998 - a short form of {Quetzalcoatlus}, which expresses the fact that the gun was a very large {Herschel loop} that was not an {emu}. Shortly afterwards Leithner also built a p56 Quetzal using a mechanism found by Noam Elkies for this purpose. In October 1998 Stephen Silver constructed a p55 Quetzal using Elkies' p5 {reflector} of the previous month. Quetzals of periods 57-61 have since been constructed. Some of the more recent Quetzals are not Herschel loops, but are instead short Herschel tracks firing several glider streams all but one of which is reflected back to the beginning of the track to create a new Herschel. Noam Elkies first had the idea of doing this for the p55 case, and Stephen Silver constructed the resulting gun shortly after building the original (much larger) p55 Quetzal. Jason Summers later built a p54 version, which is more complicated because the evenness of the period makes the timing problems considerably more difficult."
  },
  {
    "name": "Quetzalcoatlus",
    "description": "A giant flying dinosaur after which Dieter Leithner named his p54 gun. Usually abbreviated to {Quetzal}, or simply Q (as in Q54, Q55, Q56, Q-gun, etc.)."
  },
  {
    "name": "racetrack",
    "description": "A pattern in which a {signal} makes its way in a loop through an \"obstacle course\" of reactions in order to demonstrate various ways that the signal can be reflected, temporarily stored, and converted. The more different reactions that are used the better the racetrack. David Goodenough built racetracks for p30 and p46 {technology} in 1995. Racetracks are also known for {Herschel conduit} {technology}, and simple ones are useful for building {oscillator}s and {glider gun}s."
  },
  {
    "name": "rake",
    "description": "Any {puffer} whose debris consists of {spaceship}s. A rake is said to be forwards, backwards or sideways according to the direction of the spaceships relative to the direction of the rake. Originally the term \"rake\" was applied only to forwards c/2 glider puffers (see {space rake}). Many people prefer not to use the term in the case where the puffed spaceships travel parallel or anti-parallel to the puffer, as in this case they do not rake out any significant region of the Life plane (and, in contrast to true rakes, these puffers cannot travel in a stream, and so could never be produced by a {gun}). Although the first rakes (circa 1971) were c/2, rakes of other velocities have since been built. Dean Hickerson's construction of {Cordership}s in 1991 made it easy for c/12 diagonal rakes to be built, although no one actually did this until 1998, by which time David Bell had constructed c/3 and c/5 rakes (May 1996 and September 1997, respectively). Jason Summers constructed a 2c/5 rake in June 2000 (building on work by Paul Tooke and David Bell) and a c/4 orthogonal rake in October 2000 (based largely on reactions found by David Bell). The smallest possible period for a rake is probably 7, as this could be achieved by a 3c/7 orthogonal backwards glider puffer. The smallest period attained to date is 8 (Jason Summers' {backrake}, March 2001)."
  },
  {
    "name": "reaction envelope",
    "description": "The collection of {cell}s that are alive during some part of a given active reaction. This term is used for {Herschel} {circuit}s and other stable circuitry, whereas {construction envelope} is specific to recipes in {self-constructing} circuitry. There are some subtleties at the edges of the envelope. Specifically, two reactions that have the exact same set of cells defining their envelopes may have different behavior when placed next to a single-cell protrusion like the tail of an {eater1}, or one side of a {tub}. The difference depends on whether two orthogonally adjacent cells at the edge of the envelope are ever simultaneously alive, within the protruding cell's {zone of influence}."
  },
  {
    "name": "reburnable fuse",
    "description": "A very rare type of {fuse} whose output is identical to its input, possibly with some spatial and/or temporal offset. See {lightspeed wire} for an example. Reburnable fuses are used primarily in the construction of fixed-speed {self-supporting} {macro-spaceship}s, where the speed of the fuse's burning reaction becomes the speed of the spaceship. Examples include the {Caterpillar}, {Centipede}, and {waterbear}."
  },
  {
    "name": "recovery time",
    "description": "The number of {tick}s that must elapse after a {signal} is sent through a {conduit}, before another signal can be safely sent on the same path. In general, a lower recovery time means a more useful conduit. For example, the {Snark}'s very low recovery time allowed for the creation of {oscillator}s with previously unknown {period}s, 43 and 53. For the most part this is a synonym for {repeat time}. However, {overclocking} a complex circuit can often allow it to be used at a {repeat time} much lower than its safe recovery time."
  },
  {
    "name": "recursive filter",
    "description": "A {toolkit} developed by Alexey Nigin in July 2015, which enables the construction of patterns with population growth that asymptotically matches an infinite number of different superlinear functions. Toolkits enabling other, sublinear infinite series had been completed by Dean Hickerson and Gabriel Nivasch in 2006. See {quadratic filter} and {exponential filter}. Sublinear functions are possible using the recursive-filter toolkit as well. It can be used to construct a glider-emitting pattern with a slowness rate S(t) = O(log***...*(t)), the nth-level iterated logarithm of t, which asymptotically dominates any primitive-recursive function f(t)."
  },
  {
    "name": "reflectorless rotating oscillator",
    "description": "A pattern that rotates itself 90 or 180 degrees after some number of {generation}s, with the additional constraint that multiple non-interacting copies of the pattern can be combined into a new oscillator with a period equal to the appropriate fraction of the component oscillators' period. The second constraint disqualifies small time-symmetric {oscillator}s such as the {blinker} and {monogram}. A working RRO might look something like a {pi orbital} or {p256 gun} loop containing one or more {pi}s or {Herschel}s in the same loop, but without any external stabilisation mechanism. Such patterns can be proven to exist (see {universal constructor}), but as of June 2018 none have been explicitly constructed in Life. There is no upper limit on {multiplicity} for a constructor-based RRO."
  },
  {
    "name": "regulator",
    "description": "An object which converts input {glider}s aligned to some period to output gliders aligned to a different period. The most interesting case is a {universal regulator}, of which several have been constructed by Paul Chapman and others."
  },
  {
    "name": "repeater",
    "description": "Any {oscillator} or {spaceship}."
  },
  {
    "name": "repeat time",
    "description": "The minimum number of generations that is possible between the arrival of one object and the arrival of the next. This term is used for things such as {reflector}s or {conduit}s where the {signal} objects ({glider}s or {Herschel}s, for example) will interact fatally with each other if they are too close together, or one will interact fatally with a disturbance caused by the other. For example, the repeat time of Dave Buckingham's 59-step B-heptomino to Herschel conduit (shown under {conduit}) is 58."
  },
  {
    "name": "replicator",
    "description": "A finite pattern which repeatedly creates copies of itself. Such objects are known to exist (see {universal constructor}), but no concrete example is known. The {linear propagator} may be considered to be the first example of a replicator built in Life, but this is debatable as each of its copies replicates itself only once, allowing no possibility of {superlinear growth}."
  },
  {
    "name": "reverse caber tosser",
    "description": "A storage mechanism for data feeding a {universal constructor} designed by Adam P. Goucher in 2018. A very large integer can be encoded in the position of a very faraway object. If the distance to that object is measured using {circuit}ry designed to be as simple as possible, a complete decoder and universal constructor can be created by colliding a small number of gliders - no more than 329 according to a June 2018 {glider synthesis}, and exactly 43 according to a July 1 redesign by Chris Cain using eight far-distant {GPSE}s and, amazingly, no stationary circuitry except for a single {catalyst} {block}. Some intermediate designs with 50+ gliders need no stationary circuitry at all. With the correct placement of the faraway object, the complete pattern is theoretically capable of building any glider-constructible object. This means that 43 is the maximum number of gliders required to build any constructible object, no matter what size. However, it is not possible to determine in practice what the locations of these 43 gliders should be, even for a relatively simple construction."
  },
  {
    "name": "R-mango",
    "description": "A small active reaction, so named because it is a single-cell modification of a {mango}, but now more commonly known as {dove}."
  },
  {
    "name": "rock",
    "description": "Dean Hickerson's term for an {eater} which remains intact throughout the eating process. The {snake} in Dave Buckingham's 59-step B-to-Herschel conduit (shown under {conduit}) is an example. Other still lifes that sometimes act as rocks include the {tub}, the {hook with tail}, the {eater1} (eating with its tail) and the {hat} (in Heinrich Koenig's stabilization of the {twin bees shuttle})."
  },
  {
    "name": "rotor",
    "description": "The cells of an {oscillator} that change state. Compare {stator}. It is easy to see that any rotor cell must be adjacent to another rotor cell."
  },
  {
    "name": "rule 22",
    "description": "Wolfram's rule 22 is the 2-state 1-D {cellular automaton} in which a cell is ON in the next generation if and only if exactly one of its three neighbours is ON in the current generation (a cell being counted as a neighbour of itself). This is the behaviour of Life on a cylinder of width 1."
  },
  {
    "name": "ruler",
    "description": "A pattern constructed by Dean Hickerson in April 2005 that produces a stream of {LWSS} with gaps in it, such that the number of LWSS between successive gaps follows the \"ruler function\" (sequence A001511 in The On-Line Encyclopedia of Integer Sequences)."
  },
  {
    "name": "S",
    "description": "Usually means {big S}, but may sometimes mean {paperclip}."
  },
  {
    "name": "search program",
    "description": "A computer program or script that automates the search for Life objects having certain desired properties. These are used because the difficulty of finding previously unknown Life objects now commonly exceeds the patience, speed, and accuracy of humans. Various types of search programs are used for finding objects such as {spaceship}s, {oscillator}s, {drifter}s, {catalyst}s, {soup}s, {Garden of Eden}s, and {slow salvo}s. Some search programs generate {partial result}s as they are running, so even if they don't complete successfully, something of use might still be salvaged from the run. Example search programs are {dr}, {lifesrc}, {gfind}, and {Bellman}. There are other types of programs which don't perform searches as such, but instead perform large constructions. These are used to correctly complete very complicated objects such as the {Caterpillar}, {Gemini}, {Caterloopillar}, and {universal constructor}-based spaceships such as the {Demonoid}s and {Orthogonoid}s."
  },
  {
    "name": "second glider domain",
    "description": "The second glider domain of an {edge shooter} is the set of spacetime offsets, relative to the {glider} {stream} emitted by the edge shooter, where a second independent glider stream may be present without interfering with the edge shooter. This is useful to know, because edge shooters are often used to generate glider streams very close to other glider streams, to make for example a {spaceship} {gun} or {converter}."
  },
  {
    "name": "second natural glider",
    "description": "The glider produced at T=72 during the {evolution} of a {Herschel}. This is the common edge-shooting glider output used in the {NW31} converter and several other converter variants."
  },
  {
    "name": "Seeds of Destruction Game",
    "description": "An interactive search application written by Paul Chapman in 2013. Its primary purpose was to assist in the design of self-destruct circuits in self-constructing circuitry. It has also regularly been helpful in completing glider syntheses, and was used to find the {31c/240} base reaction for the {shield bug} and {Centipede} spaceships."
  },
  {
    "name": "self-constructing",
    "description": "A type of pattern, generally a {macro-spaceship}, that contains encoded construction information about itself, and makes a complete copy of itself using those instructions. The {Gemini}, {linear propagator}, {spiral growth} patterns, {Demonoid}s and {Orthogonoid} are examples of self-constructing patterns. Self-constructing spaceships often have trivially adjustable speeds. In many cases, the direction of travel can also be altered, less easily, by changing the encoded {construction recipe}. Compare {self-supporting}, {elementary}."
  },
  {
    "name": "self-supporting",
    "description": "A type of pattern, specifically a {macro-spaceship}, that constructs {signal}s or {track}s or other scaffolding to assist its movement, but does not contain complete information about its own structure. Examples include the Caterpillar, {Centipede}, {half-baked knightship}, {waterbear}, and the {Caterloopillar}s. {Caterpillar} has been used as a general term for self-supporting spaceships, but it is not very appropriate for the HBKs. In general a self-supporting pattern cannot be trivially adjusted to alter its speed or direction. The variable speeds of the HBKs and the Caterloopillars are exceptions, but their direction of travel is fixed, and a specific Caterloopillar can't be made to change its speed without completely rebuilding it. Compare {self-constructing}, {elementary}."
  },
  {
    "name": "semi-Snark",
    "description": "Any small {stable} {signal} {conduit} that produces one output glider for every two input gliders, with a 90 degree reflection. These can act as period-doublers for any glider stream whose period is at least equal to their repeat time, and so adding one of these to a single glider {gun} often results in a pattern much smaller than the older {technology} of crossing the output of two guns. The available semi-Snarks differ in their complexity, size, repeat time, and the colour of their output gliders. The {CC semi-Snark} was the first one found, and the term \"semi-Snark\" is often used specifically for this object. The \"CC\" prefix stands for {colour-changing}, by contrast with the more recently discovered {colour-preserving} {CP semi-Snark}. There are also CC and CP variants of a semi-Snark based on a two-{glider} to {century} {converter} discovered by Tanner Jacobi in November 2017. These {semi-cenark}s are the fastest semi-Snarks known as of July 2018, with a {repeat time} as low as 50 ticks, or a periodic input rate as low as 36 ticks."
  },
  {
    "name": "SGR",
    "description": "Abbreviation for {stable} {glider} {reflector}. This term is no longer in use."
  },
  {
    "name": "shield bug",
    "description": "The first 31c/240 {macro-spaceship}, constructed by Dave Greene on September 9, 2014."
  },
  {
    "name": "shotgun",
    "description": "A {gun} that fires a {salvo} of multiple {spaceship}s, almost always {glider}s, on parallel {lane}s. Two to four shotguns are often combined to turn a {glider synthesis} into a gun or {factory} for that synthesis."
  },
  {
    "name": "shoulder",
    "description": "The fixed upper end of a {construction arm}, generally consisting of one or more glider {gun}s or {edge shooter}s aimed at an {elbow} object."
  },
  {
    "name": "shuttle",
    "description": "Any {oscillator} which consists of an active region moving back and forth between stabilizing objects. The most well-known examples are the {queen bee shuttle} (which has often been called simply \"the shuttle\") and the {twin bees shuttle}. See also {p54 shuttle}, {p130 shuttle} and {Eureka}. Another example is the p72 {R-pentomino} shuttle that forms part of the pattern given under {factory}."
  },
  {
    "name": "siamese",
    "description": "A term used in naming certain {still life}s (and the {stator} part of certain {oscillator}s). It indicates that the object consists of two smaller objects sharing two or more cells. See {snake siamese snake} and {loaf siamese barge} for examples."
  },
  {
    "name": "signal",
    "description": "Movement of information through the Life universe. Signals can be carried by {spaceship}s, {fuse}s, {drifter}s, or {conduit}s. Spaceships can only transfer a signal at the speed of the spaceship, while fuses can transfer a signal at speeds up to the {speed of light}. In practice, many signals are encoded as the presence or absence of a {glider} or other spaceship at a particular point at a particular time. Such signals can be combined by the collision of gliders to form logic operations such as AND, OR, and NOT gates. Signals can be duplicated using {glider duplicator}s or other {fanout} devices, and can be used up by causing {perturbation}s on other parts of the Life object. Signals are used in {Herschel conduit} circuitry, {universal constructor}s, {macro-spaceship}s, and other computational patterns such as the {pi calculator} and {Osqrtlogt} patterns."
  },
  {
    "name": "Silver G-to-H",
    "description": "A variant of the {Silver reflector} made by substituting an {Fx119} conduit for the final {NW31}, allowing a Herschel output as well as the beehive-annihilating reset glider. It is still {Spartan}, and as long as the Fx119 is followed by a {dependent conduit}, it retains the faster 497-tick {recovery time}."
  },
  {
    "name": "single-arm",
    "description": "A type of {universal constructor} using just one construction arm and {slow salvo} techniques to construct, usually, {Spartan} or near-Spartan circuitry. Compare {two-arm}."
  },
  {
    "name": "single-channel",
    "description": "A type of {universal constructor} discovered and developed by Simon Ekstrom and others starting in December 2015. The initial {elbow operation} toolkit was near-minimal, with just one {push}, one {pull}, and one output glider of each colour (see {colour of a glider}). Later searches produced a much larger and more efficient library. Single-channel {recipe}s consist of a {stream} of {glider}s on a single {lane} and aimed at a {construction elbow}, usually separated from each other by at least 90 {tick}s. In spite of these strict limitations, single-channel recipes can be made to do surprising things. For example, it is possible to build a {Snark} directly on the {construction lane} of an active construction arm, starting from a single {elbow} {block}. This can allow the arm to reach efficiently around complex obstructions by bending itself through multiple {lossless elbow}s. Known recipes can also remove an elbow when it is no longer needed, by controlled demolition of the Snark. As of June 2018, almost all single-channel recipes are made up of {singleton}s and {synchronized} pairs of gliders, but no synchronized triplets or larger groups. This is not an inherent limitation of single-channel construction, but rather a limitation in the {search program} used to find currently known single-channel {toolkit}s. A useful byproduct of this limitation is that single-channel recipes can be trivially adjusted to allow them to safely cross perpendicular data streams, including other single-channel recipes (or earlier parts of the same recipe). To avoid collisions with a crossing stream, each singleton glider or glider pair can safely be delayed by any even number of ticks, or technically by any multiple of the period of the current {intermediate target}. The final result of the construction will not be affected."
  },
  {
    "name": "singleton",
    "description": "In {single-channel} {recipe}s, a glider that is not {synchronized} with a neighboring glider in its {stream}. Compare {glider pair}."
  },
  {
    "name": "sL",
    "description": "Abbreviation for {still life}, used most often in rough measurements of the complexity of a {Spartan} constellation."
  },
  {
    "name": "slmake",
    "description": "A {search program} published by Adam P. Goucher in May 2017. It accepts as input a {constellation} of sufficiently widely separated {still life}s, and produces a {glider} {stream} that will perform a complete {slow glider construction} of that constellation, starting from a single block. One of slmake's primary uses is to make {self-constructing} patterns much easier to design and build. It is capable of finding {recipe}s not only for {Spartan} {stable} {circuit}ry, but also for other useful non-Spartan circuits such as {Snark}s, {syringe}s, and {H-to-MWSS} {converter}s, provided that they are separated from other nearby objects by a sufficient amount of empty space."
  },
  {
    "name": "slow elbow",
    "description": "A movable {construction elbow} that is controlled by a {slow salvo}, which most likely comes from a previous elbow in a multi-elbow {construction arm}. Unlike a standard elbow which is generally fixed on a single {construction lane} or at least within a narrow range, a slow elbow can move freely in two dimensions as long as there is room for it. Each slow elbow added to a construction arm results in an exponential increase in the cost (in gliders) of the final construction. Compare {lossless elbow}."
  },
  {
    "name": "smoke",
    "description": "Debris that is fairly long-lived but eventually dies completely. Basically, a large {spark}. This term is used especially when talking about the output from a {smoking ship}. Some {Herschel conduit}s such as {Fx119} also create large amounts of smoke."
  },
  {
    "name": "smoking ship",
    "description": "A {spaceship} which produces {smoke}. If the smoke extends past the edge of the rest of the spaceship, then it can be used to perturb other objects as the spaceship passes by. Running gliders into the smoke is often a good way to turn or duplicate them, or convert them into other objects. Sometimes the smoke from a smoking ship may itself be perturbed by accompanying spaceships in order to form a {puffer}. A simple example of a smoking ship is the {Schick engine}."
  },
  {
    "name": "snake bit",
    "description": "An alternative name for a {boat-bit}. Not a very sensible name, because various other things can be used instead of a snake. A snake, or alternatively an {aircraft carrier}, is the smallest object that can consume a glider {stream} by effectively acting as an {eater} for every two incoming gliders. The one-cell reduction from the smallest real eater, the seven-cell {eater1}, has been important when trying to construct recent {sawtooth}s where the {population} must be minimized."
  },
  {
    "name": "Snarkmaker",
    "description": "A {single-channel} {stream} of {glider}s that, when aimed to collide with an {elbow} {block} in a specific location, will perform a {slow glider construction} of a {Snark}, directly on the same {lane} as the incoming gliders. This allows a {construction arm} to add one or more {lossless elbow}s, so that it can bend around multiple corners without an exponential increase in construction cost. The Snarkmaker recipe used in the first single-channel {Demonoid}, {Orthogonoid}, and {spiral growth} patterns contains 2,254 gliders. This could be considerably reduced with a customized {search program}."
  },
  {
    "name": "sombrero",
    "description": "One half of {sombreros} or {siesta}."
  },
  {
    "name": "space dust",
    "description": "A part of a {spaceship} or {oscillator} which looks like a random mix of ON and OFF cells. It is usually very difficult to find a {glider synthesis} for an object that consists wholly or partly of space dust. As examples, the {295P5H1V1}, {fly}, and {seal} spaceships contain large amounts of space dust."
  },
  {
    "name": "spaceship",
    "description": "Any finite pattern that reappears (without additions or losses) after a number of generations and displaced by a non-zero amount. By far the most {natural} spaceships are the {glider}, {LWSS}, {MWSS} and {HWSS}, followed by the {Coe ship} which has also evolved multiple times from random asymmetric {soup} starting conditions. See also the entries on individual spaceship speeds: {c/2 spaceship}, {c/3 spaceship}, {c/4 spaceship}, {c/5 spaceship}, {c/6 spaceship}, {c/7 spaceship}, {c/10 spaceship}, {c/12 spaceship}, {2c/5 spaceship}, {2c/7 spaceship}, {3c/7 spaceship}, {(2,1)c/6 spaceship}, and {17c/45 spaceship}. It is known that there exist spaceships travelling in all rational directions and at arbitrarily slow speeds (see {universal constructor}). Before 1989, however, the only known examples travelled at c/4 diagonally (gliders) or c/2 orthogonally (everything else). In 1989 Dean Hickerson started to use automated searches to look for new {elementary} spaceships, and had considerable success. Other people have continued these searches using tools such as {lifesrc} and {gfind}, and as a result we now have a great variety of elementary spaceships travelling at sixteen different velocities. The following table details the discovery of elementary spaceships with new velocities as of July 2018. ------------------------------------------------------------------- Speed Direction First Discovery Discoverer Date ------------------------------------------------------------------- c/4 diagonal {glider} Richard Guy 1970 c/2 orthogonal {LWSS} John Conway 1970 c/3 orthogonal {25P3H1V0.1} Dean Hickerson Aug 1989 c/4 orthogonal {119P4H1V0} Dean Hickerson Dec 1989 c/12 diagonal {Cordership} Dean Hickerson Apr 1991 2c/5 orthogonal {44P5H2V0} Dean Hickerson Jul 1991 c/5 orthogonal {snail} Tim Coe Jan 1996 2c/7 orthogonal {weekender} David Eppstein Jan 2000 c/6 orthogonal {dragon} Paul Tooke Apr 2000 c/5 diagonal {295P5H1V1} Jason Summers Nov 2000 c/6 diagonal {seal} Nicolay Beluchenko Sep 2005 c/7 diagonal {lobster} Matthias Merzenich Aug 2011 c/7 orthogonal {loafer} Josh Ball Feb 2013 c/10 orthogonal {copperhead} zdr Mar 2016 3c/7 orthogonal {spaghetti monster} Tim Coe Jun 2016 (2,1)c/7 oblique {Sir Robin} Adam P. Goucher Mar 2018 ------------------------------------------------------------------- Several infinite families of adjustable-velocity {macro-spaceship}s have also been constructed, of which the first was Gabriel Nivasch's {Caterpillar} from December 2004. The macro-spaceship with the widest range of possible speeds is Michael Simkin's {Caterloopillar} from April 2016; in theory it supports any rational orthogonal speed strictly less than c<4. A somewhat similar design supporting any rational speed strictly less than c/2 has been shown to be feasible, but as of July 2018 no explicit examples have been constructed. A period p spaceship that displaces itself (m,n) during its period, where m>=n, is said to be of type (m,n)/p. It was proved by Conway in 1970 that p>=2m+2n. (This follows immediately from the easily-proved fact that a pattern cannot advance diagonally at a rate greater than one half diagonal step every other generation.)"
  },
  {
    "name": "Spaceships in Conway's Life",
    "description": "A series of articles posted by David Bell to the newsgroup comp.theory.cell-automata during the period August-October 1992 that described many of the new {spaceship}s found by himself, Dean Hickerson and Hartmut Holzwart. Bell produced an addendum covering more recent developments in 1996."
  },
  {
    "name": "spaghetti monster",
    "description": "The first {3c/7 spaceship}, found by Tim Coe in June 2016. The spaceship travels orthogonally, has a minimum of 702 live cells and fits in a 27x137 bounding box."
  },
  {
    "name": "spark",
    "description": "A pattern that dies. The term is typically used to describe a collection of cells periodically thrown off by an {oscillator} or {spaceship}, but other dying patterns, particularly those consisting or only one or two cells (such as produced by certain glider collisions, for example), are also described as sparks. For examples of small sparks see {unix} and {HWSS}. Examples of much larger sparks are seen in {Schick engine} and {twin bees shuttle spark}."
  },
  {
    "name": "sparker",
    "description": "An {oscillator} or {spaceship} that produces {spark}s. These can be used to {perturb} other patterns without being themselves affected."
  },
  {
    "name": "sparse Life",
    "description": "This refers to the study of the evolution of a Life universe which starts off as a random {soup} of extremely low density. Such a universe is dominated at an early stage by {block}s and {blinker}s (often referred to collectively as {blonk}s) in a ratio of about 2:1. Much later it will be dominated by simple {infinite growth} patterns (presumably mostly {switch engine}s). The long-term fate of a sparse Life universe is less certain. It may possibly become dominated by self-reproducing patterns (see {universal constructor}), but it is not at all clear that there is any mechanism for these to deal with all the junk produced by switch engines."
  },
  {
    "name": "Spartan",
    "description": "A pattern composed of subunits that can be easily constructed in any orientation, usually with a {slow salvo}. Generally this means that the pattern is a {constellation} of Spartan still lifes: {block}, {tub}, {boat}, {hive}, {ship}, {loaf}, {eater1}, or {pond}. Other small objects may sometimes be counted as Spartan, including period-2 oscillators - mainly {blinker}s, but also {beacon}s or {toad}s, which may occur as {intermediate target}s in slow salvo {recipe}s. Most {self-constructing} patterns are Spartan or mostly Spartan, to simplify the process of self-construction."
  },
  {
    "name": "speed of light",
    "description": "The greatest speed at which any effect can propagate; in {Life}, a speed of one cell per {generation}. Usually denoted c."
  },
  {
    "name": "spiral growth",
    "description": "A {self-constructing} pattern built by Dave Greene in August 2014 that uses four {universal constructor}s (UCs) arranged in a diamond to build four more UCs in a slightly larger diamond. This was the first B3/S23 pattern that exhibited spiral growth. Much smaller versions have now been constructed using the {single-channel} construction toolkit."
  },
  {
    "name": "SPPS",
    "description": "The symmetric {PPS}. The original PPS found by David Bell in May 1998. Compare {APPS}."
  },
  {
    "name": "sqrtgun",
    "description": "Any glider-emitting pattern which emits its nth glider at a time asymptotically proportional to n^2. The first examples were constructed by Dean Hickerson around 1991. See also {quadratic filter}, {exponential filter}, {recursive filter}."
  },
  {
    "name": "stable",
    "description": "A pattern is said to be stable if it is a {parent} of itself. Stable objects are oscillators with period 1 (p1), and are generally called {still life}s."
  },
  {
    "name": "stable pseudo-Heisenburp",
    "description": "A multi-stage {converter} constructed by Dave Greene in January 2007, using a complex recipe found by Noam Elkies to insert a signal into a {2c/3 wire}. The wire's high transmission speed allows a {signal} from a {highway robber} to catch up to a {salvo} of {glider}s. Ultimately the mechanism restores the key glider, which was destroyed by the highway robber in the first stage of the converter, to its exact original position in the salvo. Much smaller stable pseudo-Heisenburp devices have since been designed that use simple 0-degree glider {seed} {constellation}s instead of a 2c/3 wire. These patterns are labeled \"pseudo-Heisenburp\", because a true {Heisenburp device} does not even temporarily damage or affect a passing glider, yet can still produce an output {signal} in response. However, it is impossible to construct a {stable} device that can accomplish this for gliders. True stable Heisenburp devices are possible with many other types of {spaceship}s, but not with gliders which have no usable side {spark}s to initiate an output signal."
  },
  {
    "name": "staged recovery",
    "description": "A type of signal-processing {circuit} where the initial reaction between {catalyst}s an incoming signal results in an imperfect recovery. A catalyst is damaged, destroyed completely as in a {bait} reaction, or one or more objects are left behind that must be cleaned up before the circuit can be reused. In any of these three cases, output signals from the circuit must be used to complete the cleanup. In theory the cleanup process might itself be {dirty}, requiring additional cleanup stages. In rare cases this might theoretically allow the construction of special-purpose circuits with a lower {recovery time} than would otherwise be possible, but in practice this kind of situation does not commonly arise. An example is the record-breaking (at the time) 487-tick reflector constructed by Adam P. Goucher on 12 April 2009. 487 ticks was a slight improvement over the repeat time of the {Silver reflector}. The reflector featured a standard {Callahan G-to-H}, with cleanup by an internal {dirty} glider reflector found by Dieter Leithner many years before. This in turn was cleaned up by the usual ungainly Herschel plumbing attached to the G-to-H's output. The dirty glider reflector is not actually fully recovered before a second p487 signal enters the full reflector. However, it has been repaired by the time the internal reflector is actually needed again, so the cycle can be successfully repeated at p487 instead of p497."
  },
  {
    "name": "standard spaceship",
    "description": "A {glider}, {LWSS}, {MWSS} or {HWSS}. These have all been known since 1970."
  },
  {
    "name": "star gate",
    "description": "A device by Dieter Leithner (October 1996) for transporting a {LWSS} faster than the {speed of light}. The key reaction is the {Fast Forward Force Field}."
  },
  {
    "name": "stator",
    "description": "The cells of an {oscillator} that are always on. Compare {rotor}. (The stator is sometimes taken to include also some of those cells which are always off.) The stator is divided into the {bushing} and the {casing}. By analogy, the cells of an {eater} that remain on even when the eater is eating are considered to constitute the stator of the eater. This is not always well-defined, because an eater can have more than one eating action."
  },
  {
    "name": "statorless",
    "description": "A statorless {oscillator} is one in which no cell is permanently on - that is, the {stator} is empty, or in other words the oscillator has the maximum possible volatility. See the {volatility} entry for examples of this type of oscillator at different periods. Statorless oscillators can be constructed for any sufficiently large period, using {universal constructor} technology."
  },
  {
    "name": "step",
    "description": "Another term for a {generation} or {tick}. This term is particularly used in describing {conduit}s. For example, a 64-step conduit is one through which the active object takes 64 generations to pass."
  },
  {
    "name": "stream",
    "description": "A line of identical objects (usually {spaceship}s), each of which is moving in a direction parallel to the line, generally on the same {lane}. In many uses the stream is periodic. For example, the {new gun} produces a period 46 {glider} stream. The stream produced by a {pseudo-random glider generator} can have a very high period. Compare with {wave}. See also {single-channel} for a common use of non-periodic {glider} streams."
  },
  {
    "name": "stretcher",
    "description": "Any pattern that grows by stretching a {wick} or {agar}. See {wickstretcher} and {spacefiller}."
  },
  {
    "name": "strict still life",
    "description": "A {still life} that is either a single connected {polyplet}, or is arranged such that a {stable} smaller pattern cannot be formed by removing one or more of its {island}s. For example, {beehive with tail} is a strict still life because it is connected, and {table on table} is a strict still life because neither of the {table}s are stable by themselves. See also {triple pseudo}, {quad pseudo}. Still lifes have been enumerated by Conway (4-7 bits), Robert Wainwright (8-10 bits), Dave Buckingham (11-13 bits), Peter Raynham (14 bits), Mark Niemiec (15-24 bits), and Simon Ekstrom and Nathaniel Johnston (25-32 bits). The resulting figures are shown below; see also {https://oeis.org/A019473}. The most recent search by Nathaniel Johnston has also confirmed that the {triple pseudo} pattern found by Gabriel Nivasch is the only such still life with 32 bits or less. It is therefore included in the pseudo still life count and not in the table below. -------------- Bits Number -------------- 4 2 5 1 6 5 7 4 8 9 9 10 10 25 11 46 12 121 13 240 14 619 15 1353 16 3286 17 7773 18 19044 19 45759 20 112243 21 273188 22 672172 23 1646147 24 4051711 25 9971377 26 24619307 27 60823008 28 150613157 29 373188952 30 926068847 31 2299616637 32 5716948683 -------------- As the number of bits increases, the strict still life count goes up exponentially by approximately O(2.46^n). By comparison, the rate for pseudo still life}s is about O(2.56^n) while for {quasi still life}s it's around O(3.04^n)."
  },
  {
    "name": "superlinear growth",
    "description": "Growth faster than any rate proportional to T, where T is the number of ticks that a pattern has been run. This term usually applies to a pattern's population growth, rather than diametric growth or bounding-box growth. For example, {breeder}s' and {spacefiller}s' population asymptotically grows faster than any linear-growth pattern. It may also be used to describe the rate of increase in the number of subpatterns present in a pattern, such as when describing a {replicator}'s rate of reproduction. Due to limits enforced by the {speed of light}, no pattern's population can grow at an asymptotic rate faster than {quadratic growth}. See {switch-engine ping-pong} for the lowest-population superlinear growth pattern as of July 2018, along with a list of the record-holders."
  },
  {
    "name": "support",
    "description": "Those parts of an object which are only present in order to keep the rest of the object (such an {engine} or an edge {spark}) working correctly. These can be components of the object, or else accompanying objects used to {perturb} the object. In many cases there is a wide variation of support possible for an engine. The {arm}s in many {puffer}s are an example of support."
  },
  {
    "name": "switch-engine ping-pong",
    "description": "A very large (210515x183739) {quadratic growth} pattern found by Michael Simkin in October 2014. Currently this is the smallest starting population (23 cells) known to result in a quadratic population growth rate. Previous record-holders include {Jaws}, {mosquito1}, {mosquito2}, {mosquito3}, {mosquito4}, {mosquito5}, {teeth}, {catacryst}, {metacatacryst}, {Gotts dots}, {wedge}, {26-cell quadratic growth}, {25-cell quadratic growth}, and {24-cell quadratic growth}."
  },
  {
    "name": "synchronized",
    "description": "Indicates that precise relative timing is required for two or more input {signal}s entering a {circuit}, or two or more sets of {glider}s participating in a {glider synthesis}. Compare {asynchronous}. See also {salvo} and {slow glider construction}."
  },
  {
    "name": "tail spark",
    "description": "A {spark} at the back of a spaceship. For example, the 1-bit spark at the back of a {LWSS}, {MWSS} or {HWSS} in their less dense phases."
  },
  {
    "name": "tame",
    "description": "To {perturb} a {dirty} reaction using other patterns so as to make it {clean} and hopefully useful. Or to make a reaction work which would otherwise fail due to unwanted products which interfere with the reaction."
  },
  {
    "name": "tandem glider",
    "description": "Two gliders travelling on parallel lanes at a fixed spacetime offset, usually as a single signal in a {Herschel transceiver}. See also {glider pair}."
  },
  {
    "name": "target",
    "description": "A necessary component of a {slow salvo} recipe used by a {single-arm} {universal constructor}. A target usually consists of a single object, or sometimes a small {constellation} of common still lifes and/or oscillators. See {intermediate target}. If no {hand} target is available, a construction arm may be unable to construct anything, unless recipes are available to generate targets directly from the {elbow}."
  },
  {
    "name": "technology",
    "description": "The collective set of known reactions exploiting one subset of the Life universe. Examples of these subsets include {glider synthesis}, period 30 glider {stream}s, c/3 {spaceship}s, {sparker}s, {Herschel conduit}s, and {slow salvo}s. As new reactions and objects are found, over time any particular technology becomes more versatile and complete. Many Life experts like to concentrate on particular technologies."
  },
  {
    "name": "teeth",
    "description": "A 65-cell quadratic growth pattern found by Nick Gotts in March 2000. This (and a related 65-cell pattern which Gotts found at about the same time) beat the record previously held by {mosquito5} for smallest population known to have superlinear growth, but was later superseded by {catacryst}. See {switch-engine ping-pong} for the lowest-population {superlinear growth} pattern as of July 2018, along with a list of the record-holders."
  },
  {
    "name": "telegraph",
    "description": "A pattern created by Jason Summers in February 2003. It transmits and receives information using a rare type of {reburnable fuse}, a {lightspeed wire} made from a chain of beehives, at the rate of 1440 ticks per bit. The rate of travel of signals through the entire {transceiver} device can be increased to any speed strictly less than the {speed of light} by increasing the length of the beehive chain appropriately. \"Telegraph\" may also refer to any device that sends and receives lightspeed signals; see also {p1 telegraph}, {high-bandwidth telegraph}."
  },
  {
    "name": "ternary reaction",
    "description": "Any reaction between three objects. In particular, a reaction in which two gliders from one stream and one glider from a crossing stream of the same period annihilate each other. This can be used to combine two glider guns of the same period to produce a new glider gun with double the period."
  },
  {
    "name": "tetraplet",
    "description": "Any 4-cell {polyplet}."
  },
  {
    "name": "The Online Life-Like CA Soup Search",
    "description": "A distributed search effort set up by Nathaniel Johnston in 2009, using a Python script running in {Golly}. Results included a collection of the longest-lived 20x20 soups, as well as a {census} of over 174 billion {ash} objects. It has since been superseded by {Catagolue}."
  },
  {
    "name": "The Recursive Universe",
    "description": "A popular science book by William Poundstone (1985) dealing with the nature of the universe, illuminated by parallels with the game of Life. This book brought to a wider audience many of the results that first appeared in {LifeLine}. It also outlines the proof of the existence of a {universal constructor} in Life first given in {Winning Ways}."
  },
  {
    "name": "tie",
    "description": "A term used in naming certain {still life}s (and the {stator} part of certain {oscillator}s). It indicates that the object consists of two smaller objects joined point to point, as in {ship tie boat}."
  },
  {
    "name": "TOLLCASS",
    "description": "Acronym for {The Online Life-Like CA Soup Search}."
  },
  {
    "name": "toolkit",
    "description": "A set of Life reactions and mechanisms that can be used to solve any problem in a specific pre-defined class of problems: {glider} timing adjustment, {salvo} creation, {seed} construction, etc. See also {universal toolkit}, {technology}."
  },
  {
    "name": "torus",
    "description": "As applies to Life, usually means a finite Life universe which takes the form of an m x n rectangle with the bottom edge considered to be joined to the top edge and the left edge joined to the right edge, so that the universe is topologically a torus. There are also other less obvious ways of obtaining a toroidal universe. See also {Klein bottle}. Every object in a torus universe obviously either dies or becomes a {still life} or {oscillator}."
  },
  {
    "name": "track",
    "description": "A path made out of {conduit}s, often ending where it begins so that the active {signal} object is cycled forever, forming an {oscillator} or a {gun}. This term has also been used to refer to the {lane} on which a {glider} or {spaceship} travels. The concept is very similar, but a reference to a \"track\" now usually implies a non-trivial supporting conduit."
  },
  {
    "name": "transparent",
    "description": "In signal circuitry, a term used for a {catalyst} that is completely destroyed by the passing signal, then rebuilt. Often (though not always) the active reaction passes directly through the area occupied by the transparent catalyst, then rebuilds the catalyst behind itself, as in the {transparent block reaction}. See also {transparent lane}."
  },
  {
    "name": "transparent debris effect",
    "description": "A mechanism where a {Herschel} or other active reaction completely destroys a {catalyst} in a particular location in a {conduit}. After passing through or past that location, the same reaction then recreates the catalyst in exactly its original position. This type of catalysis is surprisingly common in {signal} {circuit}ry. For an example, see {transparent block reaction}. The transparent object is most often a very common {still life} such as a block or beehive. Rarer objects are not unknown; for example, a transparent {loaf} was found by Stephen Silver in October 1997, in a very useful {elementary conduit} making up part of a {Herschel receiver}. However, not surprisingly, rarer objects are much less likely to reappear in exactly the correct location and orientation, so transparent reactions involving them are much more difficult to find, on average."
  },
  {
    "name": "triomino",
    "description": "Either of the two 3-cell {polyomino}es. The term is rarely used in Life, since the two objects in question are simply the {blinker} and the {pre-block}."
  },
  {
    "name": "true",
    "description": "Opposite of {pseudo}. A {gun} emitting a period n stream of {spaceship}s (or {rake}s) is said to be a true period n gun if its mechanism oscillates with period n. The same distinction between true and pseudo also exists for {puffer}s. An easy way to check that a gun is true period n is to stop the output with an {eater}, and check that the result is a period-n {oscillator}. True period n guns are known to exist for all periods greater than 61 (see {My Experience with B-heptominos in Oscillators}), but only a few smaller periods have been achieved, namely 20, 22, 24, 30, 36, 40, 44, 45, 46, 48, 50, and 54 through 61. See also {Quetzal} for the 54-61 range. ------------------------------------ Period Discoverers Date ------------------------------------ 20 Matthias Merzenich May 2013 Noam Elkies 22 David Eppstein Aug 2000 Jason Summers 24 Noam Elkies Jun 1997 30 Bill Gosper Nov 1970 36 Jason Summers Jul 2004 40 Adam P. Goucher Mar 2013 Matthias Merzenich Jason Summers 44 Dave Buckingham Apr 1992 45 Matthias Merzenich Apr 2010 46 Bill Gosper 1971 48 Noam Elkies Jun 1997 50 Dean Hickerson Oct 1996 Noam Elkies Dave Buckingham 54 Dieter Leithner Jan 1998 Noam Elkies Dave Buckingham 55 Stephen Silver Oct 1998 56 Dieter Leithner Jan 1998 Dave Buckingham Noam Elkies 57 Matthias Merzenich Apr 2016 58 'thunk' Apr 2016 Matthias Merzenich Chris Cain 59 Adam P. Goucher Dec 2009 Jason Summers 60 Bill Gosper Nov 1970 61 Luka Okanishi Apr 2016 ------------------------------------"
  },
  {
    "name": "two-arm",
    "description": "The type of {universal constructor} exemplified by the original {Gemini} spaceship, where two independently programmed {construction arm}s sent gliders in pairs on 90-degree paths to collide with each other at the construction site. Construction recipes for two-arm constructors are much more efficient in general, but they require many more {circuit}s and multiple independent data streams, which both tend to increase the complexity of {self-constructing} circuitry. Compare {single-arm}."
  },
  {
    "name": "underpopulation",
    "description": "Death of a cell caused by it having fewer than two {neighbour}s. See also {overpopulation}."
  },
  {
    "name": "unit Life cell",
    "description": "A rectangular pattern, of size greater than 1x1, that can simulate Life in the following sense. The pattern by itself represents a dead Life cell, and some other pattern represents a live Life cell. When the plane is tiled by these two patterns (which then represent the state of a whole Life universe) they evolve, after a fixed amount of time, into another tiling of the plane by the same two patterns which correctly represents the Life generation following the one they initially represented. It is usual to use the prefix \"meta-\" for simulated Life features, so, for example, for the first known unit Life cell (constructed by David Bell in January 1996), one metatick is 5760 {tick}s, and one {metacell} is 500x500 cells. Capital letters were originally used to make this distinction - e.g., Generation, Cell - but this usage is no longer common. In December 2005, Jason Summers constructed an analogous unit cell for Wolfram's Rule 110, a one-dimensional {cellular automaton} that is known be universal. See also {OTCA metapixel}, {p1 megacell}."
  },
  {
    "name": "universal computer",
    "description": "A computer that can compute anything that is computable. (The concept of computability can be defined in terms of Turing machines, or by Church's lambda calculus, or by a number of other methods, all of which can be shown to lead to equivalent definitions.) The relevance of this to Life is that both Bill Gosper and John Conway proved early on that it is possible to construct a universal computer in the Life universe. (To prove the universality of a {cellular automaton} with simple rules was in fact Conway's aim in Life right from the start.) Conway's proof is outlined in {Winning Ways}, and also in {The Recursive Universe}. Until recently, no universal Life computer had ever been built in practice In April 2000, Paul Rendell completed a Turing machine construction (see {http://rendell-attic.org/gol/tm.htm} for details). This, however, has a finite tape, as opposed to the infinite tape of a true Turing machine, and is therefore not a universal computer. But in November 2002, Paul Chapman announced the construction of a universal computer, see {http://www.igblan.free-online.co.uk/igblan/ca/}. This is a universal register machine based around Dean Hickerson's {sliding block memory}. In 2009 Adam P. Goucher constructed a programmable {Spartan} universal computer/constructor pattern using stable {Herschel} circuitry. It included memory tapes and registers capable of holding a simple universal instruction set and program data, and also a minimal {single-arm} universal constructor. Its size meant that it was extremely impractical to program it to be {self-constructing}, though this was theoretically possible if the escape of large numbers of gliders could be allowed as a side effect. In February 2010, Paul Rendell completed a universal Turing machine design with an unlimited tape, as described in his thesis at {http://eprints.uwe.ac.uk/22323/1/thesis.pdf}. In 2016 Nicolas Loizeau (\"Coban\") completed a Life pattern emulating a complete 8-bit programmable computer. See also {universal constructor}."
  },
  {
    "name": "universal constructor",
    "description": "A pattern that is capable of constructing almost any pattern that has a {glider synthesis}. This definition is a bit vague. A precise definition seems impossible because it is not known, for example, whether all {still life}s are constructible. In any case, a universal constructor ought to be able to construct itself in order to qualify as such. An outline of Conway's proof that such a pattern exists can be found in {Winning Ways}, and also in {The Recursive Universe}. The key mechanism for the production of gliders with any given path and timing is known as side-tracking, and is based on the {kickback reaction}. A universal constructor designed in this way can also function as a universal destructor: it can delete almost any pattern that can be deleted by gliders. In May 2004, Paul Chapman and Dave Greene produced a prototype programmable universal constructor. This is able to construct objects by means of {slow glider construction}s. It likely that it could be programmed to construct itself, but the necessary program would be very large; moreover an additional mechanism would be needed in order to copy the program. A universal constructor is theoretically most useful when attached to a {universal computer}, which can be programmed to control the constructor to produce the desired pattern of gliders. In what follows I will assume that a universal constructor always includes this computer. The existence of a universal constructor/destructor has a number of theoretical consequences. For example, the constructor could be programmed to make copies of itself. This is a {replicator}. The constructor could even be programmed to make just one copy of itself translated by a certain amount and then delete itself. This would be a (very large, very high period) {spaceship}. Any translation is possible, so that the spaceship could travel in any direction. If the constructor makes a rotated but unreflected copy of itself, the result would be a looping spaceship or {reflectorless rotating oscillator}. The constructor could also travel slower than any given speed, since we could program it to perform some time-wasting task (such as repeatedly constructing and deleting a block) before copying itself. Of course, we could also choose for it to leave some debris behind, thus making a {puffer}. It is also possible to show that the existence of a universal constructor implies the existence of a {stable} {reflector}. This proof is not so easy, however, and is no longer of much significance now that explicit examples of such reflectors are known. Progressively smaller universal-constructor mechanisms without an attached universal computer have been used in the {linear propagator}, {spiral growth} pattern, and the {Demonoid}s and {Orthogonoid}. See also {single-channel}. Another strange consequence of the existence of universal constructors was pointed out by Adam P. Goucher and Tanner Jacobi in 2015. Any glider-constructible pattern, no matter how large, can be constructed with a fixed number of gliders, by working out a construction recipe for a universal constructor attached to a decoder that measures the distance to a faraway object. The object's position encodes a numeric value that can be processed to retrieve as many bits of information as are needed to build a {slow salvo} to construct any given target pattern. The simplest design, requiring less than a hundred gliders, is described in {reverse caber tosser}."
  },
  {
    "name": "universal regulator",
    "description": "A {regulator} in which the incoming gliders are aligned to period 1, that is, they have arbitrary timing (subject to some minimum time required for the regulator to recover from the previous glider). Paul Chapman constructed the first universal regulator in March 2003. It is adjustable, so that the output can be aligned to any desired period. A {stable} universal regulator was constructed by Dave Greene in September 2015, with a minimum delay between test signals of 1177 ticks. Later stable versions have reduced the delay to 952 ticks. A universal regulator can allow two complex {circuit}s to interact safely, even if they have different base {period}s. For example, signals from a {stable} logic circuit could be processed by a period-30 mechanism, though the precise timing of those signals would change in most cases."
  },
  {
    "name": "universal toolkit",
    "description": "A set of Life reactions and mechanisms that can be used to construct any object that can be constructed by glider collisions. Different universal toolkits were used to construct the {linear propagator}, {10hd Demonoid}, {0hd Demonoid}, and {Orthogonoid}, for example."
  },
  {
    "name": "universe",
    "description": "The topology of the cells in the Life grid. In the normal universe (the usual {Life} arena), the grid is infinite in both directions. In a cylindrical universe, the grid is finite in one direction, and the cells at the two edges are adjacent to each other. In a {torus} universe, the grid is finite in both directions, and the cells at the top and bottom edges are adjacent, and the cells at the left and right edges are adjacent. There are several other more obscure types of universe. Objects found in the cylindrical and toroidal universes can also run in the normal universe if an infinite number of copies are arranged to support each other. Sometimes the objects can be supported in other ways to make a useful finite object. This is one reason that {soup} searches are run in alternative universes, to find such objects."
  },
  {
    "name": "unknown fate",
    "description": "An object whose {fate} is in some way unanswerable with our current knowledge. The simplest way that the fate of an object can be unknown involves the question of whether or not it exhibits infinite growth. For example, the fate of the {Fermat prime calculator} is currently unknown, but its behaviour is otherwise predictable. A different type of unknown fate is that of the {Collatz 5N+1 simulator}, which may become stable, or an oscillator, or have an indefinitely growing bounding box. Its behavior is otherwise predictable, and unlike the Fermat prime calculator the population is known to be bounded. Life objects having even worse behaviour (e.g. {chaotic growth}) are not known as of July 2018."
  },
  {
    "name": "URM",
    "description": "A universal register machine, particularly Paul Chapman's Life implementation of such a machine. See {universal computer} for more information."
  },
  {
    "name": "vacuum",
    "description": "Empty space. That is, space containing only dead {cell}s."
  },
  {
    "name": "volcano",
    "description": "Any of a number of p5 oscillators which produce sparks. See {lightweight volcano}, {middleweight volcano} and {heavyweight volcano}."
  },
  {
    "name": "von Neumann neighbourhood",
    "description": "The set of all cells that are orthogonally adjacent to a cell or group of cells. The von Neumann neighbourhood of a cell can be thought of as the points at a Manhattan distance of 1 from that cell. Compare {Moore neighbourhood}. Cell neighbourhoods can also be defined with a higher range. The von Neumann neighbourhood of range n can be defined recursively as the von Neumann neighbourhood of the von Neumann neighbourhood of range n-1. For example, the von Neumann neighbourhood of range 2 is the set of all cells that are orthogonally adjacent to the range-1 von Neumann neighbourhood."
  },
  {
    "name": "waterbear",
    "description": "c/79 obliquely, p158) A {self-supporting} oblique {macro-spaceship} constructed by Brett Berger on December 28, 2014. It is currently the fastest oblique macro-spaceship in Conway's Game of Life by several orders of magnitude, and is also the smallest known oblique macro-spaceship in terms of bounding box, superseding the {Parallel HBK}. It is no longer the smallest or fastest oblique spaceship due to the discovery in 2018 of the {elementary} {knightship} {Sir Robin}. Previous oblique spaceships, the {Gemini} and the {half-baked knightship}s, are stationary throughout almost all of their life cycles, as they construct the necessary mechanisms to support a sudden short move. The waterbear constructs support for {reburnable fuse} reactions involving {(23,5)c/79 Herschel climber}s that are in constant motion."
  },
  {
    "name": "wave",
    "description": "A wick-like structure attached at both ends to moving spaceship-like patterns, in such a way that the entire pattern is mobile. Especially if the wave gets longer over time, the supporting patterns are {wavestretcher}s. Also, the gliders or spaceships emitted by a rake may be referred to as a wave, again because the line as a whole appears to move in a different direction from the individual components, due to the rake's movement. Compare with {stream}. In general a wave can be interpreted as moving at a variety of different velocities, depending on which specific subcomponents are chosen as the starting and ending points for calculating speed and direction. See {antstretcher}, {wavestretcher} for a practical example of identical wave ends being connected to spaceships with different velocities."
  },
  {
    "name": "wedge",
    "description": "A 26-cell quadratic growth pattern found by Nick Gotts in March 2006, based on ideas found in {metacatacryst} and {Gotts dots}. It held the record for the smallest-population quadratic growth pattern for eight years, until it was surpassed by {25-cell quadratic growth}. See {switch-engine ping-pong} for the lowest-population {superlinear growth} pattern as of July 2018, along with a list of the record-holders."
  },
  {
    "name": "weekender distaff",
    "description": "The first orthogonal 2c/7 rake, constructed by Ivan Fomichev on May 22nd, 2014. It uses the weak {spark}s from {weekender}s to perturb an LWSS into an active reaction in a variable-period loop, which produces a series of {slow salvo} gliders that finally rebuilds the LWSS."
  },
  {
    "name": "weld",
    "description": "To join two or more {still life}s or {oscillator}s together. This is often done in order to fit the objects into a smaller space than would otherwise be possible. The simplest useful example is probably the {integral sign}, which can be considered as a pair of welded {eater1}s."
  },
  {
    "name": "Wheels, Life, and other Mathematical Amusements",
    "description": "One of Martin Gardner's books (1983) that collects together material from his column in Scientific American. The last three chapters of this book contain all the Life stuff."
  },
  {
    "name": "wick",
    "description": "A stable or oscillating linearly repeating pattern that can be made to {burn} at one end. See {fuse}. Wicks are often fairly dense, with repeating units directly connected or at least adjacent to each other, as in the beehive {lightspeed wire} for example. However, sparse wicks such as the blocks in the {31c/240 Herschel-pair climber} are known, and arbitrarily sparse wicks can be constructed."
  },
  {
    "name": "wicktrailer",
    "description": "Any {extensible} {tagalong} or {component} that can be attached to itself, as well as to the back of a {spaceship}. The number of generations that it takes for the component to occur again in the same place is often called the period of the wicktrailer. This has little relation to the period of the component. See {branching spaceship} for an example of a wicktrailer that is part of a p2 spaceship, but repeats itself in the same location at period 20."
  },
  {
    "name": "WinLifeSearch",
    "description": "Jason Summers' GUI version of {lifesrc} for MS Windows. It is available from {http://entropymine.com/jason/life/software/}."
  },
  {
    "name": "Winning Ways",
    "description": "A two-volume book (1982) by Elwyn Berlekamp, John Conway and Richard Guy on mathematical games. The last chapter of the second volume concerns Life, and outlines a proof of the existence of a {universal constructor}."
  },
  {
    "name": "wire",
    "description": "A repeating stable structure, usually fairly dense, that a {signal} can travel along without making any permanent change. Known wires include the diagonal {2c/3 wire}, and orthogonal {lightspeed wire} made from a chain of beehives. Diagonal lightspeed wires are known, but the required signals are fairly complex and have no known {glider synthesis}."
  },
  {
    "name": "with-the-grain grey ship",
    "description": "A {grey ship} in which the region of density 1/2 consists of lines of ON cells lying parallel to the direction in which the spaceship moves. See also {against-the-grain grey ship}."
  },
  {
    "name": "*WSS",
    "description": "Any of the standard orthogonal {spaceship}s - {LWSS}, {MWSS}, or {HWSS}. At one point the term {fish} was more common for this group of spaceships."
  },
  {
    "name": "Xlife",
    "description": "A popular freeware Life program that runs under the X Window System. The main Life code was written by Jon Bennett, and the X code by Chuck Silvers."
  },
  {
    "name": "zone of influence",
    "description": "The set of cells on which a chosen cell or pattern can potentially exert an influence in a given number of generations N. If N is not specified it is generally taken to be one, in which case the zone of influence simply coincides with the Moore neighbourhood of the cell or pattern. The set for N generations consists of all the cells to which at least N paths of length N can be traced from the cell(s) in question. Contrast this with the range-N Moore neighbourhood, which consists of all cells to which at least one path of length n can be traced."
  }
]